{"URL": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNG56qCTQF_ZwSb5L66HZz0QrKMUUQ&clid=c3a7d30bb8a4878e06b80cf16b898331&ei=29_qV6jRJpLG3QHsjKTIDQ&url=http://www.investopedia.com/articles/company-insights/092716/5-worst-products-apple-ever-had-aapl.asp", "body": "Apple Inc. (NASDAQ: AAPL) enjoys a reputation as one of the most successful and innovative businesses in the world. The company created a string of successful brands, including Mac, iPhone and iPad, and has the highest market capitalization of any publicly traded company in the world. However, not everything that the company produced over the years has been a success. In particular, five Apple products rank as the worst products that the company ever produced.\n\nApple launched Macintosh TV in 1993, which it touted as a both a computer and a television. The product contained a mouse, a keyboard and an attached television screen, and retailed for over $2,000. The Macintosh TV failed with consumers, and the company discontinued production after only four months and 10,000 units. Critics complained that the device could be used as either a computer or television, but not both at the same time. In addition, the computer only offered one-quarter of the random access memory (RAM) storage of other Macintosh computers. While the Macintosh TV was supposed to combine computing and television, in reality it was two clunky devices with no integration.\n\nIn 1996, Apple released a gaming console in partnership with Japanese toy company Bandai Co., Ltd. The product was Apple's attempt to compete in the crowded gaming space against Nintendo Co. Ltd. (OTC: NTDOY), Sega and several new entrants, but the product was a commercial failure. Bandai reportedly sold less than half of the estimated 100,000 consoles it produced. While Pippin's design and components were adequate, its biggest flaw was that it only offered 22 games to users. Furthermore, Pippin was an online gaming system, which also was a drawback in 1996 since internet service was slower and less available. Ultimately, consumers felt that Pippin fell short when compared to Commodore CDTV, NEX PCFX, Philips 3DO and other competitors, and the gaming console's $599 price tag may have been too steep for consumers given its limitations.\n\nIn 2000, Apple introduced the G4 Cube, a cube-shaped computer with a clear case and a price tag starting at $1,799. The product had very similar features to the Power Mac G4 Tower, which sold for $200 less. Although the G4 Cube was aesthetically pleasing, it had serious design flaws that caused it to crack easily and overheat often. The device lacked an external cooling fan, which was the reason for these problems. Apple acknowledged that demand was one-third of what it expected and ended production of the G4 Cube before the product reached its first anniversary.\n\nApple sold the Macintosh Performa x200 series computer starting in 1995. While the product had an attractive physical design, it had serious engineering flaws that made it difficult to use. Apple used a powerful 64-bit central processing unit (CPU) in the device but paired it with a motherboard designed to accommodate a less powerful 32-bit chip, which led to slow performance. The poor design of the Macintosh Performa x200 series contributed to the longstanding perception that Macintosh computers were slower than Windows PC systems.\n\nThe 20th Anniversary Macintosh was Apple's attempt to integrate a personal computer with a built-in television, FM tuner and Bose subwoofer. The device, which the company launched in 1997, retailed for $7,499. It was designed by Jony Ive and incorporated many modern design features used in later Macintosh products. Apple distributed the device in the United States, Japan, France, Germany, the United Kingdom and Australia. However, the 20th Anniversary Macintosh had similar computing power to other Macintosh computers that sold for thousands of dollars less. The astronomical cost of this machine led to its demise. Apple ended manufacturing production of the 20th Anniversary Macintosh less than a year after it launched the product.", "category": "tech", "title": "5 Worst Products That Apple Ever Had (AAPL)"}