{"URL": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNG05dxMdvngtJNZQYN6nxNZcqZqEA&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52779219079268&ei=PNDqV6DdFY_Q3QGnyqfoDg&url=http://www.profitconfidential.com/stock/aapl-stock-apple-bears-chart/", "body": "As the biggest company in the world, Apple Inc. (NASDAQ:AAPL) deserves to be under the microscope from time to time. But if we don’t step back to look at the big picture once in a while, we could lose perspective on what makes Apple stock (AAPL) so great.\n\nFor instance, a lot of analysts started whining when “iPhone” sales began to fall. They acted like it was the end of AAPL stock. So I took a closer look at the company, expecting to see it in a state of decay. What I found was shocking.\n\nApple stock isn’t dead. It isn’t even injured. The drop in iPhone sales may look pretty bad at close range, but remember to take a step back. Look at the big picture. Apple still has the key ingredient to success, but most analysts won’t even talk about that because it doesn’t make for a dramatic headline.\n\nHere’s the truth: AAPL stock is driven by an “ecosystem” unlike anything else in the tech sector. I would say that Amazon.com, Inc. (NASDAQ:AMZN) is coming close with its “Prime” membership, but they still haven’t eclipsed Apple’s dominance. It is the ultimate safeguard to Apple stock, thus the reason why I’m still bullish on AAPL stock.\n\nBut before we get into the details, let’s address the question: what in the world is an “ecosystem?” Think about it this way. If you live in the same neighborhood for a few years, you tend to develop a network. Your local dentist. Your local mechanic. Your accountant. Lawyer. Grocer. The list goes on and on.\n\nThat is your ecosystem. The more connections you have, the less inclined you are to move away from that neighborhood. Tech companies use the same principle to create an attachment between you and their products. No one is better at this than Apple, which means AAPL stock is protected from harm.\n\nIf this sounds too vague, then it’s time I prove it to you.\n\nThere are over 1 billion Apple devices on a planet with only 7 billion people. It is the most successful consumer electronics company of all time, primarily because Steve Jobs knew how to lock customers into the Apple ecosystem.\n\nThe strength of the ecosystem has become clear after Apple released its latest iPhone.\n\nAt first, the new iPhone garnered a ton of criticism about the removal of the headphone jack. But then mobile carriers like AT&T Inc. (NYSE:T) and T-Mobile reported that iPhone 7 pre-orders were shooting through the roof. Sprint Communications Inc said their orders were five times higher than last year’s iPhone 6 orders. (Source: “IPhone 7 preorders at Sprint are almost 5 times higher than last year’s 6s,” CNBC, September 20, 2016.)\n\nOn top of all that, the company released a newer version of its operating system. The new “iOS” platform was upgraded at roughly the same time as the competing “Android” software, but customers responded very differently on each platform. Take a look at this stunning chart:\n\nMore than 34% of Apple’s users jumped on board by updating the software and 60% are using the next most recent version. By contrast, less than 0.1% of Android users bothered to upgrade their software. In other words, Apple users are way more engaged with the company’s products.\n\nThey buy iPhones, “iPads,” and “Macbooks.” All of their music is saved to “iTunes.” It’s possible they even have “Apple TVs” and “Apple Watches.” The bottom line is that it’s too difficult for these users to move out of Apple’s ecosystem. It’s too important to them, meaning that Apple stock isn’t as vulnerable as analysts believe.", "category": "tech", "title": "AAPL Stock: Apple Inc. Stock Bears HAVE to See This Chart (NASDAQ:AAPL)"}