{"URL": "http://www.fool.com/investing/2016/09/12/apple-inc-has-now-amassed-nearly-80-billion-in-deb.aspx", "body": "That was fast. It's only been about three years since Apple (NASDAQ:AAPL) started actively issuing bonds in order to fund its aggressive share repurchase program. The strategy has always been to use bond offerings to bolster its domestic cash position, allowing it to keep the majority of its money mountain abroad and avoid repatriation taxes. In that short amount of time, the Mac maker has since accumulated approximately $80 billion in debt, which is greater than the market caps of many companies.\n\nAt the end of last quarter, Apple had $72.4 billion in total long-term debt (including current and non-current). It then sold $7 billion worth of paper at the end of July, bringing the total to nearly $80 billion. Note that this total does not include commercial paper, which Apple started selling in 2014. Apple currently has $12.5 billion of commercial paper outstanding in addition to long-term debt.\n\nThe debt strategy has been quite successful thus far. Apple has been able to fund its highly accretive share repurchase program without needing to bring foreign cash home, of which there was $215 billion at the end of last quarter. Meanwhile, the interest and dividend income from Apple's broader investment portfolio actually covers the interest payments and more than services the debt, so there is no net cost to Apple.\n\nBut still, there is some limit where enough is enough. Apple can't just continue issuing debt ad nauseam, even if its consolidated net cash position is still $159 billion. There are signs that Tim Cook is aware of this.\n\nIn a recent radio interview, Cook mentioned that Apple does expect to repatriate billions of dollars as early as next year. While the CEO didn't disclose an exact amount, he said that Apple has \"provisioned several billion dollars\" for taxes, which suggests that the Mac maker will be bringing home quite a bit considering the current repatriation rate of 35%. Apple has lobbied hard to get Congress to lower that rate, arguing that the U.S. would benefit from many companies repatriating cash and investing it domestically.\n\nIt's quite telling that Apple is sharing its plans to repatriate a bunch of money, warning investors to brace themselves for a hefty tax bill. It's also possible that the EU's recent decision that Apple owes $14.5 billion in back taxes related to its Irish tax breaks (which Apple is appealing) calls into question the viability of the company's international tax-minimization strategies.\n\nYou know that Apple wouldn't voluntarily choose to pay those taxes unless it absolutely had to, which implies that it feels that its debt load is approaching some comfort limit.\n\nEvan Niu, CFA owns shares of Apple. The Motley Fool owns shares of and recommends Apple. The Motley Fool has the following options: long January 2018 $90 calls on Apple and short January 2018 $95 calls on Apple. Try any of our Foolish newsletter services free for 30 days. We Fools may not all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors. The Motley Fool has a disclosure policy.", "category": "tech", "title": "Apple, Inc. Has Now Amassed Nearly $80 Billion in Debt --"}