{"URL": "http://www.slate.com/articles/technology/future_tense/2016/09/apple_s_airpods_aren_t_just_wireless_earbuds_they_re_the_future_of_computing.html", "body": "It s easy to glance at the AirPods, their price tag, and all the ways Apple stands to gain from them, and to write them off as a frivolous upsell. It is suspiciously convenient for Apple that its new flagship phones will singlehandedly create a mass market for expensive new categories of headphones that it s uniquely positioned to dominate, thanks to its 2014 acquisition of Beats. It s equally easy and correct to mock Apple VP of Marketing Phil Schiller s runic rationale for jettisoning the jack:  It comes down to one word: courage.  (You can find a slightly more illuminating glimpse into the process that informed Apple s decision in this BuzzFeed piece.) No wonder the public s first reaction was to gripe about how likely the AirPods are to be misplaced, or even swallowed.\n\nBluetooth, as everyone knows, is an infuriating technology. Pairing is a hassle, switching between devices is tortuous, and the connection tends to cut out at the most annoying possible moments. Despite all this, Bluetooth headphones recently surpassed conventional ones in sales revenue, according to a July study by the retail analyst NPD, with Beats  offerings leading the way. Just imagine how well they d sell if they actually worked.\n\nApple believes it has solved this problem. The AirPods, along with multiple new lines of wireless Beats headphones, combine Bluetooth with proprietary technology to make pairing with Apple devices and switching between them a snap. What exactly that proprietary technology is, Apple isn t telling. But it happens on a new kind of processor that Apple and Beats have embedded in their wireless earpieces, called the W1 chip. The upshot is that Apple controls both ends of the pairing process, resulting in a Bluetooth experience that  just works,  to borrow a slogan from Apple s past.\n\nDoes it really? Early reports are encouraging. The Verge s Nilay Patel tried them and reported that the initial pairing was  nearly instant,  although he overheard one person complain that it took as long as 10 seconds. Even that would count as a breeze compared to Bluetooth s usual ordeal. In any case, Patel reports,  After the initial connection, it s seamless you just open the case, put them in, and go. \n\nAdmittedly, the mere mention of iCloud, Apple s notoriously confusing cloud service, is enough to cast at least a shadow of doubt on how easy all of this will be for the average user. Still, if the AirPods work anywhere near as well as Apple claims, that s not an incremental improvement over Bluetooth. It s the difference between wireless earphones that suck and ones that don t.\n\nInfrared sensors detect when the pods are in your ear, so they can automatically pause playback when you take them out and resume when you put them back in. Speak and the AirPods will detect the vibration of your voice, triggering a noise-canceling effect that will home in on your voice to distinguish it from ambient sound. (Apple achieves this with the help of special accelerometers and a  beamforming microphone,  technologies it first outlined in a 2014 patent filing.) Listen with both pods and you ll get stereo sound; just one and it will switch to mono. The W1 chip is designed to optimize battery life, giving you up to five hours of listening on a charge, while a compact wireless charging case holds another 24 hours of juice.\n\nOne more simple feature holds perhaps the most telling clue to what Apple has in mind for the future. Tap the AirPods twice while they re in your ear and you ll wake Siri, much like how you wake Amazon s Echo by saying  Alexa.  Suddenly you ll find yourself conversing with an A.I. powered voice assistant via a tiny earpiece in your ear. If that doesn t sound familiar, go watch the 2013 movie Her right now. It seems more prophetic by the day.\n\nAs is virtually always the case when Apple  invents  a new product category, it wasn t the first to get there. A German startup called Bragi raised $3.4 million on Kickstarter in 2014 to develop a set of  wireless smart headphones  called the Dash. That proved more of a challenge than anticipated, and the devices didn t begin shipping until this year. At $299, the Dash gets just 3 stars on Amazon, its rating weighed down by numerous complaints of  TERRIBLE BLUETOOTH CONNECTIVITY. \n\nAnother startup called Doppler Labs, whose stated mission is to  put a computer, speaker, and mic in every ear,  announced in June a set of smart earbuds called Here One that connects to your phone via Bluetooth and a special app. The company billed the device, which will ship in time for the holiday season, as  the first all-in-one wireless listening system.  Unfortunately for Doppler Labs, Apple s AirPods will ship in late October.\n\nBoth the Bragi Dash and Here One make their futuristic ambitions far more explicit than do Apple s AirPods. Doppler Labs imagines people leaving their earpieces in their ear pretty much all the time, using them as a sort of auditory augmented reality. The notion calls to mind Google s wishful suggestion that people might walk around all day wearing Google Glass. As with Glass, it s doubtful that most of us are prepared to bond with wireless earpieces so intimately, at least anytime soon. For Apple to even imply that the AirPods might become an always-on voice control for your entire digital life would likely trigger a backlash that could not only doom the product but set back the long-term vision that it heralds.\n\nIt sounds like the typically pompous yet harmless claptrap we ve come to expect from Ive s voiceovers. Yet behind the soft sell lies a real technological roadmap that Apple and other leading technology companies have been outlining for years. In short, the  big five  tech companies are all in the early stages of a race to wean us off of the graphical interface, the open web, and the app ecosystem, and train us to use their respective A.I. assistants as our primary portal to the internet.", "category": "tech", "title": "Apple Just Launched a Radically Futuristic New Device. It Isn t an iPhone."}