{"URL": "http://www.bloomberg.com/news/articles/2016-09-15/apple-s-20-rally-is-tough-pill-for-295-funds-that-just-bailed", "body": "Apple Inc. s third-quarter rally is unwelcome news to the unusually large swath of investors who have been giving up on the stock.\n\nShares of the iPhone maker have jumped 21 percent this quarter, trouncing the S&P 500 Index. At the same time, the number of its institutional owners has fallen 1.3 percent to 3,847 since June as 295 firms sold out of their positions entirely, a 28 percent increase from three months ago, according to regulatory filings compiled by Bloomberg.\n\nIt s another blow for active managers who are trailing the market by the most in more than a decade based on full-year results. Apple s share gain was about nine times the S&P 500 as Chief Executive Officer Tim Cook s product plans eased concern over the company s future growth.\n\n Fund managers across the board are being guilty of being too conservative,  Jeffrey Sica, who oversees $1.5 billion as the president of Circle Squared Alternative Investments in Morristown, New Jersey, said by phone.  The lack of innovation at Apple has been what s kept a lot of investors away. They held back and it did hurt them. \n\nSentiment over Apple turned sour as the company ended 13 straight years of uninterrupted sales growth earlier in 2016. Omega Advisors Inc. and Lansdowne Partners are among firms who exited the shares in the second quarter. Since the end of June, Apple buyers have fallen 4.6 percent while sellers, including those who cut stakes or exited completely, increased 4.4 percent.\n\nGrowing pessimism turned out to be misplaced as the stock staged the biggest weekly rally in five years. Even as the S&P 500 suffered its worst retreat since the U.K s vote to exit the European Union over the past week, Apple shares stood as one of the biggest winners.\n\nWith gains exceeding 2 percent every day since last Friday, the stock is up 12 percent, beating all but one companies in the S&P 500. T-Mobile US Inc. and Sprint Corp. said they d received almost four times as many orders for the iPhone 7 as previous models, fueling speculation that the new product is off to a faster start than usual.\n\nApple said late Wednesday that its new iPhone 7 Plus and the smaller jet-black iPhone 7 sold out during the company s online pre-order period. Those devices won t be available to buy for walk-in customers at Apple stores when sales start Friday, a company spokeswoman said.\n\n Positive pre-order and other data points suggest iPhone 7 may exceed low expectations,  Morgan Stanley analyst Katy Huberty, wrote in a note to investors Wednesday. She s bullish on the stock in part because it only requires a quarter of existing iPhone users to upgrade for the company to beat consensus analyst estimates.\n\nMisjudgments of Apple have backfired in the past. In 2014, when most professional investors decided Apple euphoria was wearing thin, the stock surged 38 percent, beating the S&P 500 by the most for any largest American company since Microsoft Corp. s 49 percent outperformance during the Internet boom a decade ago. That year, eight of 10 funds focusing on large growth stocks trailed their benchmark.\n\nFund performance is already on a fragile footing this year. According to Bank of America Corp., only 15 of large-cap funds have beat their benchmarks, on course for their worst year since at least 2003.", "category": "tech", "title": "Apple s 21% Rally Is Tough Pill for 295 Funds That Bailed"}