{"URL": "http://investorplace.com/2016/09/aapl-stock-dip-buy/", "body": "A correction has quietly descended on Apple Inc. (NASDAQ: ), bringing opportunity in its wings.\n\nFollowing the moonshot earlier this month driven by epic demand for the latest iPhone iteration, shares of the tech titan were desperately overbought. And lest you were unaware, chasing extended stocks is fraught with folly. The risk-reward ratio is poor, the odds of failure high.\n\nWhich is why the recent price dip was a necessity for quality AAPL stock plays moving forward.\n\nThus far, the drop in Apple stock has retraced a mere one-third of its rocketship rise. Fibonacci lovers will note potential support is forming around the 38.2% retracement level, which is often a gathering ground for anxious dip buyers.\n\nWhether Monday s bounce attempt holds or we pull back further before sufficient demand rushes in remains to be seen. But make no mistake about it, this dip is a rousing buy.\n\nThe early September rip in AAPL shares was the real deal. Monster volume accompanied the rise, revealing institutions were accumulating Apple hand over fist. Couple that with the increasing momentum created during the stock s last upswing and we have a situation where the odds that the current dip gets bought are very high.\n\nIt s also worth noting the trend for AAPL is now healthy as a horse. With the stock having remounted all major moving averages, it s deep into bullish territory. Sure, the 200-day moving average (green line in chart) is still descending, but give it time. It s a tanker of an average that takes ages to turn.\n\nThe options market offers innumerable avenues for capitalizing on the Apple stock chart. Those wishing to structure a high-probability trade might consider the bull put spread strategy.\n\nAlso known as a short put vertical, the bull put consists of selling out-of-the-money puts we think will expire worthless. We re effectively betting where the stock won t go.\n\nSell the Oct $108 put and buy the Oct $104 put for a net credit of 43 cents or better. The reward is capped at the initial 43 cents credit and will be captured if AAPL stock sits above $108 at expiration.\n\nThe risk is limited to the distance between strikes minus the net credit, or $3.57, and will be forfeited if Apple tumbles below $104 by expiration.\n\nAt the time of this writing Tyler Craig had no positions on any of the aforementioned securities.", "category": "tech", "title": "Apple: Take a Bite out of the AAPL Stock Dip"}