{"URL": "http://www.investopedia.com/articles/insights/060116/apple-plans-sell-1-billion-30year-bonds-aapl.asp", "body": "Shares of Apple, Inc. (AAPL) are under pressure in early trading Wednesday, falling as much as 1% on reports that the tech giant plans to issue bonds in Taiwan that are valued at $1 billion, according to sources cited by Reuters. (See also: Apple Stock Down 11% So Far This Year.)\n\nApple's bond sales follows the foray of other technology giants such as Intel Corporations (INTC), which has sold billions of dollars on Taiwan's debt market, which is flourishing with long-term buyers of debt, Reuters points out. And most of these buyers are life insurance firms, who are looking for creditworthy names and higher yields.\n\nSeparately, on Wednesday Bloomberg reported that Apple is also considering a return to Australian bonds to take advantage of another booming market. Citing two people familiar with the matter, Bloomberg noted that Apple has hired Australia & New Zealand Banking Group Ltd., Deutsche Bank AG and Goldman Sachs Group Inc. for a potential deal in the Australian currency.\n\nIt not known that Apple plans to do with the cash it plans to raise, but reports suggest that the Cupertino-based company could use that cash to fund it buybacks and dividends. The company recently increased its buyback authorization to $175 billion from $140 billion, while hiking the quarterly dividend by 10% to 57 cents per share. (See also: Apple Bets a Billion on China's Uber, Didi Chuxing.)\n\nRegarding the Taiwanese market, it's possible that the planned bond offering is likely to help Apple secure solid partnership with its suppliers, analysts told Reuters. Apple has a massive supply chain in the country, including iPhone manufacturer Foxconn.\n\nThere are plenty of reasons Apple might be motivated to sell bonds. Not the least of which involves the rumored media M&A interest in possibly Netflix, Inc. (NFLX) or Time Warner (TWX), according to the Financial Times. It's likely that Apple, which has the bulk of its $232 billion in cash overseas, is looking for liquidity to leave its M&A options open should an opportunity presents itself.", "category": "tech", "title": "Apple Plans to Sell $1 Billion of 30-Year Bonds (AAPL)"}