{"URL": "http://investorplace.com/2016/09/apple-inc-aapl-mystery-device-amazon-echo/", "body": "Amazon.com, Inc. (NASDAQ: ) has had the opportunity to build a big lead in the smart home thanks to its stealthy approach of hiding Alexa in its Amazon Echo wireless speaker. With Alphabet Inc (NASDAQ: , NASDAQ: ) on the verge of launching its own Google Home version, it appears Apple Inc. (NASDAQ: ) will also soon join the fray.\n\nReports have a Siri-powered prototype now in testing, and a mystery wireless device just hit the FCC for approval.\n\nConsumer technology giants like Apple, Google and Microsoft Corporation (NASDAQ: ) had been seen as having a leg up on Amazon when it comes to the smart home. Their personal assistants   Siri, Google Now and Cortana   are integrated into their smartphones, tablets and PCs. That means a huge, mobile user base.\n\nAmazon has Alexa, but with no smartphone presence, its impact was limited. With the next big tech battle shaping up to be the fight to be at the center of the smart home   the hub that controls all those connected devices   Amazon was at a big disadvantage.\n\nThen it came up with the idea for the Amazon Echo.\n\nThe company integrated its Alexa personal assistant within a connected speaker equipped with an array of microphones. The Amazon Echo turned into an unlikely hit with consumers.\n\nBesides listening to and controlling streaming music, they can order products from Amazon, check the weather and they can control a large and growing array of smart home devices and appliances. All by voice, all without having to lift up a smartphone. And it s not limited to the living room.\n\nThe success of the Amazon Echo caught everyone off guard. Early in September, AMZN announced Alexa had passed the 3,000  Skills  milestone. That means 3,000 services or products that can be controlled using the Echo. That s not just a big number   it s big growth. The figure was tripled in three months and includes partnerships with a growing number of well-known companies.\n\nWith its stealth approach, Amazon was suddenly in the driver s seat in the race to be at the center of the connected home.\n\nAlphabet was the first to announce it was fighting back, with Google Home. Also a connected, voice-activated speaker.\n\nApple has been mum on its plans. However, the rumor mill says AAPL is hard at work on its answer to Amazon. The latest is a report from Bloomberg that says a Siri-powered device designed to be Apple s voice-activated smart home hub is now in the prototype testing phase.\n\nAdding fuel to the fire, MacRumors picked up on a submission by Apple to the FCC for approval of a mystery device. The wireless device carries identification numbers that don t correspond to any current Apple products. Accompanying technical drawings hint at something with rounded edges that appears to be smaller than the Apple TV.\n\nCould it be the Amazon Echo competitor?\n\nNaturally, with Apple being Apple   that is to say, extremely secretive   we won t know for certain if it s working on an Amazon Echo competitor until the day it s officially announced. It seems likely, though.\n\nAmazon is building up a big lead. It s expanding the Echo product line with smaller and less expensive versions in an attempt to broaden its appeal, even as a growing parade of partners signs on. Alphabet is about to join the battle, just in time for the holiday shopping season.\n\nSiri is a successful and well-known voice assistant. The Apple TV is in millions of living rooms. The iPhone is the most popular smartphone in the U.S., Apple Music is one of the top music streaming services. Apple owns Beats (one of the best-known names in personal audio). HomeKit has been integrating smart device controls with iOS for several years.\n\nApple has all the pieces to build a killer, voice-activated speaker. With the success of the Amazon Echo and looming arrival of Alphabet, it has the motivation to do so.\n\nThe only question is when.\n\nAs of this writing, Brad Moon did not hold a position in any of the aforementioned securities.", "category": "tech", "title": "Apple (AAPL) \"Mystery Device\" Could Be an Amazon Echo Killer"}