{"URL": "http://www.wsj.com/articles/apple-leads-bond-market-back-to-life-1455641719", "body": "Apple Inc. AAPL 0.19 % led a slate of new bond sales after a nearly two-week lull, suggesting investors remain eager to lend to big blue-chip companies despite concerns that a global recession could be developing.\n\nThe tech company, a prolific issuer in recent years as its overseas cash pile has increased, set the size of its sale at $12 billion on Tuesday afternoon, the high side of investor expectations. Apple has been widely followed in the debt market since it sold $17 billion in 2013, which at the time ranked as the biggest corporate-bond sale on record. On Tuesday, it offered a 10-year bond to yield roughly 3.28%, 1.5 percentage points more than benchmark Treasurys.\n\nApple was selling bonds Tuesday alongside firms such as International Business Machines Corp. IBM 1.81 % and Comcast Corp. CMCSA 0.55 % , taking advantage of an improved market tone as U.S. stocks rallied. Markets have been whipsawed in recent weeks amid worries that a slowdown in China and plunging commodity prices could lead to a global recession and drag on the U.S. But the bond deals are a sign that investors still are relatively optimistic about U.S. economic fortunes.\n\nThose firms all carry investment-grade ratings, which are triple-B-minus or above. But even some junk-rated companies, which are lower rated and more sensitive to broader economic conditions, were wading into the market Tuesday. Prestige Brands Holdings Inc., PBH 0.10 % which sells health-care and household cleaning products, sold $350 million to help pay for an acquisition of DenTek Holdings Inc., which distributes oral-care products.\n\nBond sales got off to a solid start earlier this year, with Anheuser-Busch InBev BUD -0.24 % NV selling $46 billion in January, a deal that ranked as the second-largest corporate-bond sale on record. But sales dropped off last week, and investment-grade corporate debt sales are tracking below last year s pace.\n\nSo far, $134 billion have been sold, compared with $157 billion last year at this time, though Tuesday s deals should boost this year s figure, according to data provider Dealogic.\n\nHighly rated corporate bond sales in the U.S. hit record levels in each of the past four years, according to Dealogic, driven by low interest rates set by policy makers who hoped it would help boost the economy after the financial crisis.\n\nDespite the more positive tone Tuesday, some analysts remain concerned that the debt binge of recent years could make it more difficult for corporations to pay back investors, as well as reduce their financial flexibility should a recession materialize.\n\nA report from Moody s Investors Service MCO 0.92 % on Tuesday said that $947 billion of U.S. junk-rated corporate debt would mature between now and 2020, a record.\n\nThe ratings firm said it expects that  weak refinancing conditions will make it more difficult for lower-rated companies to access the capital markets. \n\nMoody s is more optimistic for investment-grade firms, which also have a record $864 billion maturing through 2020. The ratings firm said that  strong and stable credit quality among this cohort of issuers will give them sufficient access to the capital markets to refinance their debt. ", "category": "tech", "title": "Apple Leads Bond Market Back to Life"}