{"URL": "http://www.valuewalk.com/2016/07/apple-inc-aapl-seals-7-billion-bond-sale/", "body": "Apple Inc. (NASDAQ:AAPL) has filed a final pricing term sheet which reveals that the company raised $7 billion in debt via a five-part bond sale.\n\nThe sale involved both fixed and floating rate notes, according to the sheet filed with the U.S. Securities and Exchange Commission (SEC) this Friday. The sale was underwritten by J.P. Morgan Securities, Goldman Sachs, Deutsche Bank Securities, MLPF&S, and others.\n\nApple Inc. (NASDAQ:AAPL) has sold notes consisting of $350 million maturing in 2019 with a floating interest rate based on three month LIBOR plus 14 basis points, $1.15 billion maturing in 2019 with a fixed 1.1% interest rate, $1.25 billion maturing in 2021 with a fixed 1.55% interest rate, $2.25 billion maturing in 2026 with a fixed 2.45% interest rate and $2 billion maturing in 2046 with a fixed 3.85% interest rate.\n\nAs of the third fiscal quarter Apple Inc. (NASDAQ:AAPL) held $231.5 billion in cash and marketable securities, with $68.9 billion in long-term debt. However a large proportion of that money is currently held outside of the United States and repatriation would incur a big U.S. tax bill.\n\nThe bond sale allows Apple Inc. (NASDAQ:AAPL) to pay for its U.S. business more cheaply. This is particularly true when you consider the company s low-risk Aa1/AA+ bond credit rating.\n\nIt is thought that the company will use the capital to pay dividends to shareholders and fund its share buyback initiative. The latter was boosted to $175 billion this April, with Apple Inc. (NASDAQ:AAPL) predicting that its capital return program will stretch to $250 billion by the end of March 2018.\n\n They ve become very accustomed to coming to market,  said Jody Lurie, a credit analyst at Janney Montgomery Scott.  While it s still notable, they still have the AA ratings and there are a lot of investors who want or need to own the bonds for various reasons, it doesn t have the same level of allure. \n\nHowever Lurie admits that the higher-quality rating enjoyed by Apple Inc. (NASDAQ:AAPL), coupled with hunger for bonds among investors, allows the company to borrow at lower rates. The analyst believes that some people will sell older debt in the company in order to invest in the new set of more liquid securities.", "category": "tech", "title": "Apple Inc. (AAPL) Seals $7 Billion Bond Sale"}