{"URL": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNE1ofwzyCRGxklJ_Car-Y_w7mP_VA&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52779217847887&ei=PNDqV6DdFY_Q3QGnyqfoDg&url=http://investorplace.com/2016/09/apple-inc-aapl-stock-mclaren-project-titan-tesla/", "body": "Apple’s open secret is getting a bit more light shed on it after a report from the Financial Times claims AAPL is in talks to buy the luxury carmaker McLaren Technology Group.\n\nAccording to the article, talks between Apple and McLaren began “several months ago,” with AAPL looking to either buy McLaren outright or invest heavily in it.\n\nWith a McLaren deal netting just shy of $2 billion, it would Apple’s largest buy since acquiring Beats from Dr. Dre in 2014.\n\nMcLaren is a producer of luxury sports cars, often fetching as much as $1 million per car, which would certainly pit Apple within the luxury market Tesla Motors Inc (NASDAQ: ) targets with its higher-end vehicles.\n\nThe McLaren deal, however, is already being questioned due to a “recent shift in Apple’s car strategy,” which could point to the billion dollars AAPL invested in Chinese ride-hailing startup Didi Chuxing, as recent rumors have pointed to Apple’s foray into the car market as more akin to Uber rather than Tesla.\n\nBut Apple could buy McLaren for the company’s patents and technologies. According to the New York Times, Apple’s seen a retention problem with its car initiative, as Apple CEO Tim Cook reportedly fired dozens of people on the project, which has shifted focus from an electric vehicle to an autonomous car.\n\nWith McLaren under its hood, Apple would have a loss-making machine on its hands. The company reportedly lost about 22.6 million British pounds in 2014. It would also, however, have a large team of automotive engineers and patents, as well as valuable research, manufacturing and data analyses.\n\nUPDATE: A spokesman for McLaren Technology Group has said that the luxury automaker is not in talks with Apple Inc. (NASDAQ: ) about a possible takeover.\n\nAccording to the official statement from McLaren, “We can confirm that McLaren is not in discussion with Apple in respect of any potential investment.”\n\nAnd that’s all it says.\n\nHowever, the Financial Times, via a tweet, says it’s still backing its story despite the report.\n\nAs of this writing, John Kilhefner did not hold a position in any of the aforementioned securities.", "category": "tech", "title": "Apple Inc. May Buy British Luxury Carmaker McLaren (AAPL)"}