{"URL": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNHNg-OiZTCVdiqH-RGgljQABDa7sA&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52779219576118&ei=PNDqV6DdFY_Q3QGnyqfoDg&url=https://www.thestreet.com/story/13750429/1/apple-aapl-stock-down-japanese-regulators-explore-antitrust-action.html", "body": "NEW YORK (TheStreet) -- Shares of Apple  (AAPL)  were retreating in early-afternoon trading on Friday as Japanese regulators are considering taking action against the company over alleged antitrust violations.\n\nThe officials claim that Apple may have refused to sell discounted iPhones to third-party retailers in Japan, Reuters reports, citing sources.\n\nInstead, major Japanese carriers bought iPhones in bulk from Apple and sold them at a discount, giving the Cupertino, CA-based company an advantage over competitiors such as Samsung (SSNLF).\n\nThe strategy has helped Apple maintain demand for new iPhones, establishing Japan as one of its most profitable markets, Reuters noted. Apple accounts for nearly one in every two smartphones purchased in Japan.\n\nIf Japanese officials decide to take action, it could hurt Apple's profit margins and slow demand for its newest iPhone 7 model, Reuters added.\n\nSeparately TheStreet Ratings objectively rated this stock according to its \"risk-adjusted\" total return prospect over a 12-month investment horizon. Not based on the news in any given day, the rating may differ from Jim Cramer's view or that of this articles's author. TheStreet Ratings has this to say about the recommendation:\n\nTheStreet Ratings team rates Apple as a Buy with a ratings score of B+. This is driven by a few notable strengths, which it believes should have a greater impact than any weaknesses, and should give investors a better performance opportunity than most stocks it covers. The company's strengths can be seen in multiple areas, such as its largely solid financial position with reasonable debt levels by most measures, expanding profit margins and notable return on equity. The team feels its strengths outweigh the fact that the company has had lackluster performance in the stock itself.", "category": "tech", "title": "Apple (aapl) stock down, japanese regulators explore antitrust action"}