{"URL": "http://www.reuters.com/article/us-apple-bonds-taiwan-idUSKCN0YN3B6", "body": "Apple plans to sell $1 billion of 30-year bonds in Taiwan - sources\n\nA customer enters the new Apple store, which is the world's largest, on its opening day at Covent Garden in London August 7, 2010.\n\nTAIPEI Apple Inc plans to issue bonds in Taiwan for the first time with the aim of raising $1 billion, sources familiar with the matter said, joining a queue of big global names that have sold billions of dollars on the island's busy debt market.\n\nLiquidity in the Taiwanese bond market is flush, with long-term buyers of debt, primarily life insurance firms, seeking creditworthy names and chasing higher yields. Blue-chip multinationals regularly issue dollar bonds of such size on the island, home to Apple's supply chain.\n\nIn December, U.S. chipmaker Intel Corp sold $915 million of 30-year bonds with yields of 4.7 percent. A month later, global brewer Anheuser Busch InBev SA issued a $1.47 billion bond of the same maturity at 4.915 percent, according to data from the Taipei Exchange, the island's over-the-counter market.\n\nCash-rich and yield-hungry investors in Taiwan have made the island a haven for debt financing. These investors tend to hold through maturity, letting issuers lock in cheap pricing.\n\n\"Taiwan insurance companies don't have enough good (quality) fixed-income investment targets,\" said an official at a local securities house, declining to be identified as he was not authorised to talk to the media.\n\n\"But their funds continue to grow because in this low rate macro-environment. Consumers prefer to buy financial products offered by insurance companies rather than park money in a bank deposit,\" he said.\n\nThe planned offering is likely to help Apple secure solid partnership with its suppliers, analysts said. Taiwan is home to Apple's massive supply chain that includes iPhone manufacturer Foxconn, formally known as Hon Hai Precision Industry Co, contract chipmaker Taiwan Semiconductor Manufacturing Co and lens producer Largan Precision Co.\n\nThe U.S. dollar bonds will have a tenor of 30 years and be calleable after the second year, the sources told Reuters on Wednesday, speaking on condition of anonymity.\n\nApple declined to comment when asked about the plan.\n\nSo far this year, upwards of $16 billion in new U.S. dollar bonds have been issued, already more than half of the $29 billion in U.S. dollar bonds sold for all of 2015, OTC exchange data shows.\n\nThe OTC exchange, where corporate bonds can trade in the secondary market, said it was not aware of any plan by Apple to issue bonds. In Taiwan, bond issuers only need three days or less to notify the exchange before being listed.\n\nMarket participants have been looking at initial yields of around 4.2 percent to 4.3 percent on the planned Apple bonds, two of the sources said.\n\nThe island's 30-year government bond, which is less liquid in the secondary market, was last quoted around 1.6475 percent.", "category": "tech", "title": "Apple plans to sell $1 billion of 30-year bonds in Taiwan - sources | Reuters"}