{"URL": "http://money.usnews.com/investing/articles/2016-09-21/apple-inc-aapl-desperately-needs-a-new-brilliant-product", "body": "Sales of the iPhone fell for the first time in history earlier this year in the fiscal second quarter, then fell once more in the third. For a product that originally debuted in 2007, that's not such a bad track record.\n\nIt's not entirely Apple's fault that iPhone sales are stumbling; the smartphone market as a whole is stagnating. In the first quarter of 2016, smartphone shipment growth grew less than 0.2 percent annually, according to IDC, registering the smallest growth ever.\n\nUnfortunately for AAPL, the smartphone market is fizzling just as iPhone competitors are heating up. Two Chinese rivals in particular, Oppo and Vivo, have been taking huge swaths of Apple's market share in Asia, a continent that was once touted as Apple's best avenue for growth.\n\nWith major carriers like Verizon Communications (VZ), Sprint Corp. (S) and AT&T (T) rolling back subsidies for iPhones, the cost of a new phone now falls squarely on the consumer, who, as it turns out, isn't so eager to pony up $800 now that the cost falls on them. The introduction of monthly payment plans have reduced this burden, but we're still seeing longer upgrade cycles that hurt Apple and other smartphone makers.\n\nAlthough some like to shower current CEO Tim Cook with blame for the current low-growth state of AAPL, one of the most turbocharged growth stocks of this century, that's simply what tends to happen to mature growth companies: they slow down eventually.\n\n\"Tim Cook has been a great administrator and steward of the company, and that's exactly who you want in that kind of role where you have a big company where the downside is large and the upside is minimal,\" Portell says.\n\nApple \"is not a risk-taking company. I don't think you want a chief executive in that company that's a risk taker   you make the wrong mistake, and you lose half the value of the company overnight. That's not a good CEO,\" Portell says.\n\n\"As far as innovation, Apple definitely needs to kind of step up their game, and I think they'll do that,\" says Jordan Edelson, founder and CEO of Appetizer Mobile, a leading mobile application development agency in New York.\n\nBut how? Will it be another Apple Watch? The long-awaited final version of Apple TV? Even rumors that Apple is working on a car have been swirling for a while now, but many don't expect that to come around until 2019 or later. What can we expect soon   that isn't called an iPhone?\n\n\"They're probably working on some sort of augmented reality headset,\" Edelson says. \"The next big thing for them is gonna be AR; Tim Cook's teased it a number of times, and they've made investments in terms of the staff and the type of people they've hired.\"\n\n\"Apple will likely do a full-scale redesign for 2017 for the iPhone's 10th anniversary, but overall, the smartphone market is maturing, and most of the innovation is pushing into augmented reality and virtual reality, not the handsets,\" Spoonauer says.\n\n\"Their next big blockbuster product could be an augmented reality wearable headset, maybe in late 2017. At the very least, it will play a big role in the next iPhone,\" Spoonauer says. \"Apple also seems keenly interested in wearables and especially fitness, and you might see them debut a fitness wearable that's more simple in 2017 that goes directly up against the Fitbit (FIT).\"\n\nWhatever Apple's next new product is, it couldn't come sooner. AAPL can get by just fine for a few years by iterating on iPhones, but \"getting by\" isn't what Apple shareholders are used to.\n\n\"It's more of a marathon than a sprint with them. For investors, that might not be enough. I think investors are looking for big news and big product releases,\" Edelson says.\n\nYes, they are. So whether it's AR or a car, it's time for an entirely new Apple product the public hasn't seen yet. One it doesn't know it needs.\n\n", "category": "tech", "title": "Apple (AAPL) Desperately Needs a New Brilliant Product"}