{"URL": "http://investorplace.com/2016/09/apple-stock-iphone-7-sales-slam-aapl/", "body": "Apple Inc. (NASDAQ: ) took a quick afternoon dive on Friday, as traders sold Apple stock hard in response to negative iPhone 7 data from market research firm GfK.\n\nGFK s data, based on  channel checks,  shows that the iPhone 7 and iPhone 7 Plus launch weekend units are off roughly 25% year-over-year versus the iPhone 6s and 6s Plus. That data includes 12 European countries, China, Australia and Taiwan, but does not include the United States.\n\nPrior to this, several analysts had been upgrading Apple stock. RBC Capital, for instance, believed  (Average Selling Prices) could surprise investors on the upside due to both increased preference for iPhone 7+ and $20 higher ASP this year vs. last generation.  That was part of a note in which RBC Capital s Amit Daryanani upped his price target on Apple stock from $120 to $125. UBS also liked what it saw out of early indicators of iPhone 7 sales, prompting it to upgrade AAPL to a  Buy  and hike its price target from $115 to $127.\n\nApple itself announced that it would not be disclosing any iPhone 7 launch numbers, presumably in part with this kind of action in mind. In a release, AAPL said  initial sales will be governed by supply, not demand, and we have decided that it is no longer a representative metric for our investors and customers. \n\nThus, AAPL investors have had to get their information elsewhere, including the telecoms. T-Mobile US Inc (NASDAQ: ), for instance, said iPhone 7 launch numbers were four times greater than the iPhone 6. Sprint Corp (NYSE: ) and AT&T Inc. (NYSE: ) also said iPhone 7 orders were up, though Verizon Communications Inc. (NYSE: ) wasn t seeing the same fervor.\n\nBusiness Insider pointed out a Digitimes report out earlier in the day saying that analog chip suppliers estimated chip orders for the iPhone 7 and iPhone 7 plus would fall 20% in Q1 2017.\n\nThe GfK data sent Apple stock off by more than 2% to the $112 area, where they quickly bounced in response, recovering to about $112.60. The $112 region is where AAPL shares used as brief support earlier this month before vaulting higher to around the $115 area; Apple has been fighting this price area ever since.\n\nThe next means of support is the 20-day moving average around $109.40, with the 50-day around $106.70.", "category": "tech", "title": "Apple (AAPL) Stock Slammed by Report of Lower iPhone 7 Sales"}