{"URL": "http://seekingalpha.com/article/4007246-fomc-meets-enjoy-silence-lasts", "body": "The S&P 500 rose 0.53% last week and NASDAQ shot up a sparkling 2.31%, led by an 11.4% gain in its biggest-cap stock, Apple (NASDAQ:AAPL). We may see a more significant rise in the market over the next 10 days since that will be the last chance for portfolio managers to complete their quarter-ending, window dressing trades. (Please note: Louis Navellier does not currently own a position in AAPL. Navellier & Associates, Inc. does currently own a position in AAPL for some client portfolios.)\n\nWe are now in the last day of the \"quiet period\" before the Federal Open Market Committee (FOMC) emerges from its deliberations to tell the world its decision tomorrow. Fed officials have not been allowed to talk to the media over the last week. Since the financial media loves to fixate on the question of whether or not the FOMC will raise key interest rates tomorrow, I want to assure you that I still believe that the Fed will NOT raise key interest rates - due to an incredibly bearish Beige Book survey that did not foresee any significant GDP growth in the second half of 2016, and other downbeat economic data.\n\nOn the day the Fed's 'cone of silence' began last Tuesday, we saw very poor demand for new 30-year Treasury bonds; so the yield curve tilted up last week, putting many long-term bonds and dividend stocks under pressure. Apparently, all the gossip about the Fed raising rates spooked long-term investors. However, the demand for intermediate-term Treasury securities was much better, with a higher bid-to-cover ratio, so bond investors apparently now prefer the more intermediate-term Treasury securities.\n\nMy crude oil prediction on CNBC on August 31 is looking very good (see \"Energy stocks are heading for a correction, Louis Navellier says,\" on CNBC's Web site). Initially, I looked wrong when crude oil prices rose the following week to $47.62 on September 8th, but now we are down to $43/bbl as of last Friday's close.\n\nLast Tuesday, the International Energy Agency (IEA) said that \"supply will continue to outpace demand at least through the first half of next year.\" The IEA added that \"global inventories will continue to grow: OECD stockpiles in July smashed through the 3.1-billion-barrel wall. As for the market's return to balance   it looks like we may have to wait a while longer.\" Interestingly, the IEA blamed OPEC for the current supply glut and said, \"What we're going to need to see is some serious discipline from the OPEC producers.\" Specifically, increasing crude oil production from OPEC members Libya and Nigeria caused more fear that the crude oil supply glut will get even worse in the upcoming months.\n\nSpeaking of the current crude oil supply glut, on Tuesday, the American Petroleum Institute reported that U.S. crude oil inventories rose by 1.4 million barrels in the latest week. The bottom line is that worldwide demand is declining due to seasonal travel patterns and lackluster economic growth, so crude oil, diesel, and gasoline prices are expected to continue to steadily decline in the upcoming months.\n\nWhile anything's possible - the Fed may act irrationally and raise rates tomorrow - deflationary forces are still stronger than inflation, so any Fed rate increase will prove to be counterproductive. In addition to falling crude oil prices, we are also seeing falling food prices. Last Wednesday, the Labor Department reported that import prices declined 0.2% in August as a stronger U.S. dollar put downward pressure on imports from China, Canada, and the euro-zone. In the past 12 months, import prices have declined 2.2%. Largely due to falling food prices, U.S. export prices are also off over 2% (-2.4%) in the past 12 months.\n\nI should add that Eurostat reported on Wednesday that industrial production declined 1.1% in July as the euro-zone seems to be suffering from a manufacturing recession. Especially notable is that mighty Germany's exports declined 2.6% in July vs. June, and are down a startling 10% vs. July 2015. As long as economic output is contracting like this around the world, deflationary forces will continue to spread.\n\nOn Thursday, the Commerce Department announced that U.S. retail sales declined 0.3% in August, the first monthly decline since March. July's retail sales were revised up to a 0.1% increase, from an initial estimate of \"unchanged.\" Excluding vehicle sales, August retail sales declined 0.1%, which was a big disappointment, since economists were estimating that retail sales excluding autos would rise 0.2%. In addition, vehicle sales declined 0.9% in August as consumers are clearly becoming more cautious.\n\nSince consumer spending is responsible for virtually all of economic growth, now that the manufacturing sector is contracting, the fact that overall retail sales are struggling in the first two months of the third quarter should cause most economists to trim their third-quarter GDP forecasts. In fact, U.S. economic growth may actually now be on the verge of contracting unless consumer spending improves.\n\nOn Friday, the Labor Department announced that the Consumer Price Index (CPI) rose 0.2% in August, but that is somewhat misleading since the rise was almost entirely due to a 1% increase in medical care, the largest monthly increase since 1984. Specifically, the cost of prescription drugs soared 1.3% in August and has risen 6.3% in the past 12 months. More importantly, inflation-adjusted wages declined 0.1% in August and have only risen 1.3% in the past 12 months. This lack of wage growth will definitely cause the Fed to postpone any key interest rate increase for now, since Fed Chair Janet Yellen is a labor economist who has repeatedly said that she wants to see wages rise before raising key interest rates again.\n\nClearly, the \"data dependent\" Fed should not raise key interest rates at its FOMC meeting this week if the U.S. economy is on the verge of slipping into a recession and most prices are essentially flat or falling.\n\nDisclosure: *Navellier may hold securities in one or more investment strategies offered to its clients.\n\nDisclaimer: Please click here for important disclosures located in the \"About\" section of the Navellier & Associates profile that accompany this article.", "category": "tech", "title": "As The FOMC Meets, Enjoy The Silence (While It Lasts)"}