{"URL": "http://seekingalpha.com/article/4005664-avoid-sanofi-bonds", "body": "If you pay close enough attention to the financial markets, you probably feel like you've followed Alice down the rabbit hole. Why? Because investors are lining up to lose money. And that's not because of some pyramid scheme or a get rich quick idea. The culprits are companies like French drug maker Sanofi SA (NYSE:SNY), which just sold investors bonds that, based on the price at which they sold, lock in losses. Here's what you need to know and why you should be scared.\n\nSanofi is a name you may have heard of since it's an international drug giant with a $100 billion market cap. It's not a fly by night outfit and it hasn't done anything wrong. In fact, it's only taking advantage of the current market environment to sell bonds to eager buyers at what are, really, unheard of prices - for Sanofi, anyway.\n\nWhat does that mean? Well, the drug giant sold EUR 1.15 billion worth of bonds due in 2027 with an interest rate of 0.5%. Better yet, for Sanofi, it sold EUR 850 million worth of bonds due in 2022 with an annual coupon of 0%. That's right zero. Which was the interest it will pay on the last batch of bonds it sold, too; 1 billion Euro worth due in 2020.\n\nEssentially, Sanofi is issuing paper that will earn investors nothing. How can it get away with this? The answer boils down to overzealous central bankers. Around the world central bankers have pushed rates to historic lows. And in Europe they've taken that even further by having the central bank buy bonds, including bonds of the corporate variety. Needless to say, there's been a lot of demand for Euro debt of all sorts, pushing prices up and interest rates down.\n\nIt's why companies like McDonald's (NYSE:MCD) and Apple (NASDAQ:AAPL) have been selling bonds in Europe. And Sanofi isn't the only European giant selling bonds with crazy low rates, Unilever (NYSE:UL) has gotten in on the act, too. But there's something different about Sanofi's paper this time around, at least the shortest term paper in the sale.\n\nMore than face value\n\nBonds normally get sold at a discount to their face value. That increases the effective yield that investors get, since yield and price move in different directions. For example, earlier in the year, Sanofi sold bonds slated to pay no interest that offered an effective yield of 0.05% because they were sold just slightly below face value.\n\nBut here's the thing about the EUR 1 billion worth of 2020 bonds the company just sold... they sold above face value. So the effective yield on that debt is actually -0.05% for anyone who bought it during the bond sale. Investors are quite literally paying Sanofi for the privilege of holding Sanofi IOUs. Break that down real quick: Anyone who bought that debt has agreed to receive no interest payments between now and 2020 when they will get 0.05% less than what they paid back from Sanofi.\n\nIf that's not crazy as a hatter, I don't know what is.\n\nThe only thing that could save these investors is finding someone to buy the Sanofi debt at a higher price than what was paid. In other words, the greater fool theory. Central bankers are trying their best to help on that score, keeping rates low and continuing to buy up bonds. But buying the 2020 Sanofi paper is little more than a gamble that rates will head even lower than they are today. If rates stay where they are or go higher, anyone buying that debt loses.\n\nIf you are looking at the low rate environment and thinking it's great because your stocks have gone up, think again. This simply can't go on forever. You'd be better off shoving your money under a mattress than buying Sanofi's 2020 bonds. At some point, investors will realize that and stop the madness. The broad market drop last week is only a blip at this point. When the market truly catches on there will likely be a major market dislocation. Valuations across the board could crumble as investors demand more for the risks they are taking.\n\nIt could be ugly and it could happen very quickly. If you are an income-focused investor, now is the time to decide what you'd do if the value of the securities you own fell materially. I'm not talking 10%, I'm talking 30% to 50%. If I'm wrong and there is no bill to pay at the end of the central bank led Wonderland visit we've been forced to take, then you've done no harm to yourself. If I'm right, however, you'll have prepared yourself to deal with what could be an emotionally trying time when most investors will act first and think later.\n\nI wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.", "category": "tech", "title": "Avoid Sanofi Bonds"}