{"URL": "http://seekingalpha.com/article/4005451-bonds-plunge-stocks-follow-paradigm-shift-coming", "body": "Mike Larson of Weiss Research calls it the \"everything bubble.\" Waves of cash are sloshing around the world as central banks buy everything that isn't nailed down. The Bank of Japan is a top-10 holder in 90% of the stocks in the Nikkei 225, and the European Central Bank has gobbled up so many bonds that it's running out of paper to buy! Coupled with the Federal Reserve's persistently dovish stance on interest rates, these money flows have benefited stocks and bonds equally well. The problem is, both asset classes, which were once seen as negatively correlated, are now subject to sharp declines when the tide goes out.\n\nThe new paradigm was on full display on Friday when stocks (NYSEARCA:SPY) tanked 2.5%, the long bond (NYSEARCA:TLT) dropped 1.65% and volatility (VIX) surged a whopping 40%. Speaking of volatility, I expect a lot more of it. Stock buybacks and strong hands (a.k.a. central banks) have led the S&P to trade in its most narrow range in decades, but this may be about to change. Could stocks and bonds suffer steep losses together during the next downturn? Rates have been falling for 30 years. Nothing lasts forever.\n\nMy main goal in writing today is to remind investors that you don't have to just sit tight and take the losses when it comes to your bond allocation. Yes, there will be times when they fulfill their old role as a portfolio diversifier and counterbalance to stocks, but when rates begin their inevitable rise, a lot of investors, especially retirees, are going to get hurt. You don't have to be one of them.\n\nIf you haven't looked recently, check the duration of your bond mutual funds. Morningstar lists them as do most brokerages. Many bond mutual funds are highly sensitive to the rate environment with durations of 5 to 7 years, some much longer. A 1% rise in interest rates could cause a 5-7% drop in such a fund. If you're not comfortable with the possibility of mounting losses in your bond mutual fund, you have two alternatives.\n\nConsider buying individual bonds. I manage my mother's retirement money, and she owns a number of individual bonds with great blue chip companies like Microsoft (NASDAQ:MSFT), Apple (NASDAQ:AAPL), PepsiCo (NYSE:PEP) and Anheuser-Busch Inbev (NYSE:BUD). Schwab finally introduced the ability to sell a bond holding without calling its trading desk and I was able to liquidate some of mom's bond holdings for 10-15% cap gains before the decline last week. While I'm not suggesting actively trading individual bonds, it's nice to know the option is available. I try to stick with companies that have an AAA credit rating. Sure, there's always a small amount of credit risk involved, but for the most part, your principal is guaranteed.\n\nThere are a number of solid bond mutual funds that run strategies that limit the duration of the portfolio. My favorite is 4-star rated Metropolitan West Unconstrained Bond (MUTF:MWCRX), which has an average duration of 1.43 years and a trailing 12-month yield of 2%. I also like Western Asset Total Return Unconstrained Bond (MUTF:WAARX), which has an average duration of 1.14 years and a 3.19% yield. While not technically an unconstrained fund, I also like DoubleLine Total Return (MUTF:DLTNX). Manager Jeffrey Gundlach is hip to the interest rate risk out there, and currently limits duration to 2.29 years.\n\nIf you own bonds for income, these are all excellent options to keep the payouts flowing without exposing yourself to too much interest rate risk.\n\nIt's also possible to adopt some sort of trend-following method and time your exits and entries into a bond mutual fund or ETF, but that is beyond the scope of this article. The important thing is to have a plan.\n\nI wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.", "category": "tech", "title": "Bonds Plunge, Stocks Follow - A Paradigm Shift Is Coming"}