{"URL": "http://www.investopedia.com/news/corporations-have-been-issuing-larger-bonds-bud-shpg/", "body": "It is very likely that 2016 will be another record year for the bond markets when it comes to the total volume of  jumbo bonds,  or corporate debt securities over $5 billion, being issued. Once a rare phenomenon, 2015 could be rightfully called the explosion of the jumbo bond. According to Edward Marrinan, an analyst at investment bank HSBC, the total value of jumbo bond issuances last year reach a new high at $330 billion. That figure was three times less in the previous year, 2014.\n\nThis year large bond sales have already exceeded $270 billion, and with a little more than a quarter left to go in 2016, it is not unreasonable to expect another record breaking year for the bond market. (For more, see also: Tech Companies Have Raised Record Debt From Bond Markets This Year.)\n\nOne of the many companies that have raised billions of dollars from the bond markets in 2016 include beverage and brewing company AB InBev (BUD). At the start of the year, the company made a $46 billion dollar bond offering. They used the proceeds from that issuance to help fund their $108 billion takeover bid of SABMiller, another brewing company. This year the company also issued a  11.75 billion bond. It was considered to be the largest euro-dominated corporate bond deal.\n\nThis month Shire Pharmaceuticals (SHPG) issued a $12-billion large bond to fund its $32-billion acquisition of Baxalta, putting Shire among this year s largest corporate bond sales. Along with AB InBev and Shire, the largest jumbo bond issuers in 2016 also include Dell, Microsoft Corp (MSFT) and Apple Inc. (AAPL). (For more, see also: Boost Bond Returns With Laddering.)\n\nAs mentioned above, companies have been significantly increasing the amount of debt on their balance sheets in order to finance various mergers and acquisitions (M&A) deals. They have also been using the proceeds from bond sales to carry out share buybacks and to increase their dividend payouts to shareholders.\n\nHSBC analysts also predict jumbo bond issuances to increase over the next month in anticipation of the incoming U.S. presidential election in November, as well as the constitutional referendum of Italy and the next steps in the  Brexit  process, among other factors. The prediction also includes a steady flow of large bond issuances through the rest of 2016 and into 2017, mainly due to the pending completion of a lot of M&A transactions. And now is the time to complete them as the interest rate environment has become lower and organic growth opportunities have also been weakening as a result of slow global growth.", "category": "tech", "title": "Corporations Have Been Issuing Larger Bonds (BUD, SHPG)"}