{"URL": "http://realmoney.thestreet.com/articles/09/19/2016/cramer-amazon-lot-apple", "body": "We spent days last week bemoaning how negative and dismissive of the bond and stock markets the Delivering Alpha panelists were. The danger they saw isn't fanciful if the central banks all screw it up at once, and they are clearly betting on it. Oh, and let's be clear that we would be kidding ourselves if those who cry wolf aren't short enough that if the wolf showed up they would be in excellent shape.\n\nBut when I examined my notes from last week, I found an idea that we treated as a throw away, a minor comment from Bill Miller, the only panelist who was outright bullish: Amazon (AMZN) .\n\nI think it's worth going over his bare-bones comments because, frankly, they really make sense to me. He started his discourse on it by saying that he liked Action Alerts PLUS charity portfolio holdings Facebook (FB) , Google (GOOGL) and Growth Seeker portfolio name Amazon. May I add that I bet all three are reviled by most of the panelists that day.\n\nBut he said that Google and Facebook are both going after the same $500 billion ad market and, even if that is a huge pie to split among, Amazon, he pointed out, is going after the $5 trillion retail market.\n\nAt one point, when Amazon was primarily a book seller, you could sniff at this comment. But is there any doubt at all that all of retail is vulnerable to Amazon? I mean all of it? What can't it sell?\n\nBut it isn't just the size of the market it wants to dominate. It's the speed it is going to overtake that market. \"We've never seen a company with $100 billion in revenues growing last quarter at 30%\" with 40% growth in operating cash flow.\n\nThen there's web services, which powers the fulfillment business that has 30% margins growing.\n\nMiller made a comment I should have asked him about, which is that he said it has a three-year lead. Over whom? I don't see anyone else on the horizon.\n\nHow about international? He points out that margins are at zero headed to seven.\n\nIf things don't degrade, if they keep at these levels, Miller says you have a double in three years.\n\nNow, I bet the majority of people in this room just dismissed the idea. What did it have to so with Yellen and buying bonds but talking about tightening? What does it have to do with the Japanese trying to keep the yen down or the inability of Europe to come back? When they speak of the equity markets being dangerous, isn't Amazon the kind of equity that they are really speaking of?\n\nI can't imagine another soul in that room thinking that Amazon could double except for maybe Joe Tsai from Alibaba (BABA) , because he made it pretty clear how the opportunity for Amazon is much smaller than that of Alibaba.\n\nBut here's the point of this exercise: Amazon's a lot like Apple (AAPL) . It's something that everyone uses, it's universally loved and yet when you ask someone if they own the stock you almost always hear that it is too expensive. The rap against Apple, by the way, is that it is absurdly cheap, which then translates into the definition of a value trap.\n\nI think that both Miller and Amazon have to be taken very seriously. You don't meet a company that makes any consumer product any more that doesn't have an Amazon strategy. You don't meet a retailer who doesn't stay up at night worrying about Amazon.\n\nWe had a company on this week, Potoo, which does nothing but help you sell your goods better on Amazon. At one point, you didn't even care. Your product sold because you were somewhere in the queue, where you deserved to be. Now Amazon is like a true mall, and you need people to go into your store.\n\nPotoo, which is named after a well-hidden bird that flies around the Amazon, optimizes the third-party selling process, which is so vital because you almost every retailer feels it must use Amazon in some form. Hence why the $5 trillion market is more up for grabs than the much smaller ad market.\n\nOne other thing: Miller wasn't being defensive or dismissive when he spoke about Amazon. I thought his point could be boiled down to one concept: there's money to be made right in front of you, why don't you want to make it?", "category": "tech", "title": "Cramer: Amazon Is a Lot Like Apple"}