{"URL": "http://www.valuewalk.com/2016/09/cramer-opportunity-aapl-grow-market/", "body": "AAPL s rival Samsung was caught in a mess recently with its Galaxy Note 7 phones after it was found that the smartphone s battery could overheat and cause the phone to explode. Jim Cramer, host of CNBC s Mad Money, said this opens the door for the Cupertino-based firm to  take back a potentially enormous amount of market share. \n\nThe main choices for customers who want a high-end smartphone are a Samsung Galaxy or an Apple iPhone. Cramer credits the explosions of Samsung s phones with pushing up AAPL s stock.\n\n Considering the damage it has done to Samsung s brand, I bet there could be a lot more upside here,  Cramer says.\n\nThe Korean company has been poaching AAPL s customers for quite some time. It seemed in the second quarter that Samsung was finally catching up, with its market share ramping to 35%, whereas Apple s share declined to 50% after dropping more than nine percentage points.\n\nCramer noted that the Korean company rushed to launch its new product and sacrificed safety for more processing power, features and speed. Apple, unlike Samsung, is willing to wait by deploying new features over time. Now the iPhone maker has an opportunity to take market share, said Cramer, adding that he believes a significant number of Samsung users will now switch to iPhones.\n\n Once again, Apple s patience pays off; still one more reason why I say you should own this stock, not trade it,  says Cramer.\n\nAt the end of last week, AAPL stock pulled back after investors started to consider that maybe sales of the iPhone 7 are not going as well as expected. Bank of America Merrill Lynch saw the pullback as a buying opportunity, but KGI analysts warn that the iPhone 7 unit sales in 2016 may be less than the number of iPhone 6s units sold last year.\n\nThere have been several reports from major U.S. carriers stating that the demand for the new iPhone was much more than they saw in the early weeks of the iPhone 6s. Most analysts were excited with the reports and reacted by ramping their price targets. But there were some who were not convinced and pointed out that Verizon   the largest carrier   did not see exceptional preorder activity.\n\nOn Monday, AAPL shares closed up 0.15% at $112.88. Year to date, the stock is up more than 5%, while in the last year, it is down almost 2%.", "category": "tech", "title": "Cramer Sees Big Opportunity For AAPL To Grow Its Market Share"}