{"URL": "http://www.cnbc.com/2016/09/23/early-movers-finl-twtr-vvv-wmt-aapl-wfc-mar-bats-fb-hmhc-more.html", "body": "Check out which companies are making headlines before the bell:\n\nFinish Line   The athletic footwear and apparel retailer matched estimates with quarterly profit of 53 cents per share, with revenue above Street forecasts. Same-store sales rose 5.1 percent, also a better performance than analysts were expecting.\n\nTwitter   RBC tech analyst Mark Mahaney downgraded Twitter to \"underperform\" from \"market perform,\" predicting a 25 percent drop in the stock because of weak ad revenue.\n\nValvoline   Valvoline will debut Friday on the New York Stock Exchange after the automotive maintenance company saw its initial public offering price at $22 per share, within the expected range of $20 to $23 and raising about $660 million. Valvoline was spun off from chemical maker Ashland.\n\nWal-Mart Stores   The retailer was upgraded to \"overweight\" from \"equal-weight\" at Barclays, which said investments in improving the company's labor situation appear to be resonating with customers.\n\nApple   Japanese antitrust regulators are reportedly considering possible antitrust action against Apple over its domination of the nation's smartphone sales. A Reuters report said Apple and others were hobbling smaller competitors by refusing to sell older surplus iPhone models to third party retailers.\n\nWells Fargo   Chief Executive Officer John Stumpf has stepped down from his role on the San Francisco Federal Reserve's advisory council. That follows the controversy over the bank's sales practices, which were the centerpiece of a recent settlement with the government and of a congressional hearing earlier this week.\n\nMarriott   Marriott has completed its acquisition of Starwood Hotels, creating the world's largest hotel company. Marriott is estimating it will save $250 million annually as a result of the deal.\n\nBats Global Markets   Bats is in talks to be bought by exchange operator CBOE Holdings, according to a Bloomberg report. It's possible a deal could be announced within weeks, although the report also said the talks could fall apart.\n\nFacebook   Facebook overestimated average viewing time for its video ads for two years, according The Wall Street Journal. Facebook has reportedly fixed the issue which caused the problem.\n\nHoughton Mifflin Harcourt   Chief Executive Linda Zecher has resigned after five years. The publishing company said it has begun a search for her replacement, with board member Gordon Crovitz serving as interim CEO.\n\nVanda Pharmaceuticals   Vanda is considering strategic alternatives, according to Reuters, including a potential sale. Vanda specializes in treatments for central nervous system disorders.\n\nActivision Blizzard, Electronic Arts   Morgan Stanley initiated coverage on the two video game makers with \"overweight\" ratings, saying both are leading the industry's shift toward digital monetization and are engaging an increasing number of users.\n\nPrudential Financial   Goldman Sachs added the financial services provider to its \"conviction buy\" list, saying Prudential's asset management, retirement, and life insurance businesses are poised to continue to drive double-digit growth at a time when the stock is undervalued.\n\nYum Brands   RBC cut its rating on the restaurant operator to \"outperform\" from \"top pick,\" as it reevaluates potential upside for the stock from current levels, but still considers it a good long term value.", "category": "tech", "title": "Early movers: FINL, TWTR, VVV, WMT, AAPL, WFC, MAR, BATS, FB, HMHC & more"}