{"URL": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNFXVoVKq5Az7-nV3As441TiPA3q-A&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52779219470496&ei=PNDqV6DdFY_Q3QGnyqfoDg&url=http://investorplace.com/2016/09/fridays-vital-data-apple-inc-aapl-general-electric-company-ge-alibaba-group-holding-ltd-baba/", "body": "U.S. stock futures are dipping in premarket trading, as Wall Street looks to take a bit of a breather after rallying for three straight sessions. The Federal Reserve’s inaction on interest rates is largely responsible for the rally — because who doesn’t like easy money? — though key reports on August manufacturing and North American oil-rig counts as well as speeches from several Federal Reserve speakers have added a layer of pressure in the early going.\n\nAgainst this backdrop, futures on the Dow Jones Industrial Average have tripped 0.07% lower, while S&P 500 dropped 0.14% and Nasdaq-100 futures have slipped 0.15%.\n\nThursday’s options activity remained well above average heading into the expiration of weekly September 23 series contracts. Overall, an above-average 17.6 million calls and 14.5 million puts changed hands on the session. On the CBOE, the single-session equity put/call volume ratio retreated to 0.57, while the 10-day moving average held at 0.65.\n\nUnderpinning Thursday’s options volume, Apple Inc. (NASDAQ: ) was upgraded again — not just once, but twice — on Thursday due to iPhone 7 preorder strength. Elsewhere, General Electric Company (NYSE: ) saw unusual options activity in the October and January 2017 series that appeared to be a diagonal calendar spread. Finally, Alibaba Group Holding Ltd (NYSE: ) drummed up chatter this week after it overtook Chinese rival Baidu Inc (ADR) (NASDAQ: ) on ad revenue.\n\nApple bulls had more to cheer about yesterday after not one, but two brokerage firms lifted their price targets on the shares. RBC Capital boosted AAPL stock from $120 to $125 and reiterated its “outperform” rating on the shares, while Nomura lifted AAPL to $135 from $120 while restating its “buy” rating.\n\nBoth brokerage firms cited strong preorders for the iPhone 7, with Nomura citing healthy data points from the U.S., U.K. and Japan, while RBC highlighted significant upside to the iPhone 7’s selling price due to a shift toward the larger model.\n\nJudging by options activity on AAPL this week, traders’ enthusiasm may finally be dying down a bit. Specifically, calls have accounted for increasingly less of AAPL’s total daily volume as the weeks have worn on. On Thursday, total volume came in at 983,000 contracts, with calls only accounting for about 61% of the day’s take — down from 63% yesterday and 71% shortly after last week’s iPhone 7 preorder data hit the Street.\n\nWhile declining daily call volume by itself isn’t a major concern for AAPL bulls, rising put open interest could be a warning sign. As I noted yesterday, AAPL’s near-term put/call open interest ratio has been on the rise, and currently rests at 0.90 — which is somewhat high, historically, for AAPL.\n\nDespite a lack of headline news to drive activity, General Electric stock still cracked the top ten most active options list on Thursday. Total volume jumped to more than 203,000 contracts, with a surge in put volume to 80% of the day’s take underscoring the session’s activity. A closer look GE’s put activity yesterday, via Trade-Alert.com, reveals what appears to be a diagonal calendar spread.\n\nSpecifically, a block of 15,000 GE January 2017 $28 strike puts traded for the ask price of 54 cents, while another block of 15,000 October $30 strike puts crossed at the bid price of 49 cents. Assuming the trades are related, the total outlay for this neutral short-term/bearish long-term spread comes in at 5 cents, or $5 per pair of contracts. In short, the trader is looking for GE to hold steady until the end of the year before dropping, or a sharp rise in implied volatility for GE options.\n\nAlibaba options traders had something else to crow about yesterday after reports broke that the Chinese e-commerce giant had overtaken rival Baidu in ad revenue. The feat is none-too-small either, considering that Baidu is widely regarded as the Chinese Google (NASDAQ: , NASDAQ: ). Explosive growth in mobile advertising was the catalyst for Alibaba’s rise to prominence, marking a major shift in the Chinese internet market.\n\nOptions volume was unusually strong for BABA on Thursday. Total volume came in at 576,000 contracts, with calls snapping up 77% of the day’s take. If this trend takes hold on BABA, it could also mark a shift in sentiment for the stock. Currently, the September/October put/call open interest ratio for BABA rests at 0.93, with calls and puts nearing parity.\n\nHowever, a turn toward calls could push this ratio lower, indicating bullish expectations for the speculative options crowd.\n\nAs of this writing, Joseph Hargett did not hold a position in any of the aforementioned securities.", "category": "tech", "title": "Friday’s Vital Data: Apple (AAPL), General Electric (GE) and Alibaba (BABA)"}