{"URL": "http://www.reuters.com/article/us-global-markets-idUSKCN11E01X", "body": "A pedestrian holding an umbrella walks past an electronic board showing the stock market indices of various countries outside a brokerage in Tokyo, Japan, June 13, 2016.\n\nTraders work at their desks in front of the German share price index, DAX board, at the stock exchange in Frankfurt, Germany, September 7, 2016.\n\nTraders work on the floor of the New York Stock Exchange (NYSE) shortly after the opening bell in New York, U.S., August 30, 2016.\n\nNEW YORK A gauge of global equity markets fell modestly and the euro strengthened on Thursday after the European Central Bank fell short of market hopes for a dovish tone regarding its bond-buying program.\n\nECB President Mario Draghi said the bank was looking at options to enable it to pursue the money-printing program, but maintained the March end-date for the plan, disappointing investors who were looking for more immediate action, including an extension or expansion of the current plan.\n\nMixed data over the past month in Europe, including German industrial orders this week that showed the steepest drop in almost two years, led many market participants to speculate the ECB might take additional actions in order to stimulate Euro Zone growth.\n\n\"He sort of shut the door on further easing. That was not expected,\" said Tim Ghriskey, chief investment officer of Solaris Group in Bedford Hills, New York.\n\n\"The central banks, whether it is the U.S. or the ECB, it is clear they can change their mind on a whim, so this can certainly be changed again.\"\n\nThe euro EUR= gained ground after Draghi's comments, hitting a two-week high of $1.1326 before paring gains to trade up 0.15 percent at $1.1254. The dollar .DXY touched a low of 94.465 against a basket of major currencies before rebounding to trade up 0.1 percent at 95.054.\n\nEuropean shares closed lower, with the FTSEurofirst 300 .FTEU3 off 0.38 percent at 1,374.26.\n\nA 2.6 percent decline in shares of Apple (AAPL.O) weighed on each of the three major U.S. stock indexes in the wake of its annual event on Wednesday. The company also said it would not release details on first-weekend sales of the newly announced iPhone 7.\n\nThe Dow Jones industrial average .DJI fell 46.23 points, or 0.25 percent, to 18,479.91, the S&P 500 .SPX lost 4.86 points, or 0.22 percent, to 2,181.3 and the Nasdaq Composite .IXIC dropped 24.44 points, or 0.46 percent, to 5,259.48.\n\nMSCI's all-country world index .MWD00000PUS declined 0.31 percent after touching a 13-month high in the prior session.\n\nGerman government bond yields extended earlier gains, up 6.2 basis points on the day DE10YT=RR at minus 0.61 percent after hitting a high of minus 0.054 percent. U.S. Treasury yields also rose, with benchmark 10-year Treasury notes US10YT=RR down 20/32 in price to yield 1.6076 percent, from 1.539 percent late on Wednesday.\n\nThe focus will now begin to shift to the U.S. Federal Reserve two-day policy meeting on September 21-22 as investors look for clues on the timing of a rate hike. Expectations are for the Fed to hold rates unchanged despite another round of strong labor market data on Thursday.\n\nOil shares surged after U.S. inventory data showed a surprisingly large drawdown in crude stocks as imports into the U.S. Gulf Coast slid last week due to Tropical Storm Hermine.\n\nBrent crude LCOc1 settled up 4.2 percent at $49.99 and U.S. crude settled last up 4.7 percent at $47.62, marking the highest level since Aug. 26 for both.", "category": "tech", "title": "Global stocks slip, euro rises in wake of ECB decision | Reuters"}