{"URL": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNENW21jZkDqKqvXFTHZJxJSTqSvKQ&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52779218759966&ei=PNDqV6DdFY_Q3QGnyqfoDg&url=http://www.investopedia.com/news/googles-messaging-app-generates-privacy-concerns-goog-aapl/", "body": "According to a report in tech publication The Verge, the Mountain View company has backtracked on its promise of end-to-end encryption in the app to facilitate machine learning. This means that chat logs between users could be stored indefinitely on the company’s servers. It also means that users who conduct chat sessions in \"non-incognito mode\" will get better services from Google’s virtual assistant and, also, better auto-reply suggestions. This is because its artificial intelligence system will be able to mine data and chat logs to know more about its users. The company may also be able to put this data to use in other company divisions, such as serving up ads or providing travel planning services using Google Trips. (See also: Google Banks On AI With Its New Messaging App).\n\nAllo has come under sharp criticism from privacy advocates. Edward Snowden, whose 2013 disclosures about NSA spying practices set off alarm bells against tech companies, did not mince words in a series of tweets directed against the app.\n\nThe app’s Incognito mode, which can be selected per chat session, still offers privacy. It employs the signal protocol used by competitor Facebook Inc. (FB) for the “secret conversations” feature in its popular messaging app Whatsapp. Facebook also has an intelligent virtual assistant called M, which uses the same protocol. In addition, the assistant is powered by a combination of human curators (who are responsible for teaching responses) and AI algorithms. (See also: Facebook's M Messenger Wants To Outsmart Siri).\n\nGoogle also clarified that messages to and from the user’s network and Google servers will be encrypted. However, non-encryption on Google's servers still makes them susceptible to government interference. For example, Apple Inc. (AAPL) had a very public brawl with the FBI earlier this year regarding messages on the San Bernardino killer’s phone. The same Verge article quotes Google’s legal review team as saying that a warrant would still be necessary for government agencies, such as the FBI, to demand information from its servers.\n\nPrivacy concerns could have a domino effect on Google’s prospects. In the wake of Snowden’s disclosures about the NSA, tech companies were estimated to have lost as much as $180 billion in business from governments and consumers.\n\nGoogle is a newcomer in the booming intelligent virtual assistant market. Estimates for the industry’s prospects vary between US $3 billion in 2020 to $12.28 billion in 2024 and it has attracted a number of tech behemoths from Microsoft Inc. (MSFT) to Apple.", "category": "tech", "title": "Google's Messaging App Generates Privacy Concerns (GOOG, AAPL)"}