{"URL": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNF0qbWBEPPgVe2Apj0LTVrh6FySRQ&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52779224427345&ei=DuLqV6ieN9TC3QH1yqV4&url=http://www.chesterindependent.com/2016/09/27/investor-market-move-blackrock-japan-company-ltd-stake-in-apple-inc-aapl-has-cut-by-10-47-million-as-share-value-declined/", "body": "Blackrock Japan Company Ltd decreased its stake in Apple Inc (AAPL) by 1.26% based on its latest 2016Q2 regulatory filing with the SEC. Blackrock Japan Company Ltd sold 96,938 shares as the company s stock declined 13.08% while stock markets rallied. The institutional investor held 7.57M shares of the computer manufacturing company at the end of 2016Q2, valued at $825.39M, down from 7.67 million at the end of the previous reported quarter. Blackrock Japan Company Ltd who had been investing in Apple Inc for a number of months, seems to be less bullish one the $598.11B market cap company. The stock increased 0.15% or $0.17 during the last trading session, hitting $112.88. About 4,783 shares traded hands. Apple Inc. (NASDAQ:AAPL) has risen 19.21% since February 23, 2016 and is uptrending. It has outperformed by 7.51% the S&P500.\n\nBlackrock Japan Company Ltd, which manages about $26.85 billion US Long portfolio, upped its stake in Spdr S&P 500 Etf Tr (SPY) by 81,583 shares to 849,752 shares, valued at $174.64M in 2016Q2, according to the filing. It also increased its holding in Pepsico Inc (NYSE:PEP) by 78,848 shares in the quarter, for a total of 1.91 million shares, and has risen its stake in Verisign Inc (NASDAQ:VRSN).\n\nInsitutional Activity: The institutional sentiment decreased to 0.89 in 2016 Q2. Its down 0.26, from 1.15 in 2016Q1. The ratio dived, as 116 funds sold all AAPL shares owned while 900 reduced positions. 66 funds bought stakes while 835 increased positions. They now own 2.95 billion shares or 8.86% less from 3.23 billion shares in 2016Q1. Brown Advisory Lc, a Maryland-based fund reported 134,368 shares. Kazazian Asset Mngmt Limited Liability Corporation last reported 4.02% of its portfolio in the stock. Utd Automobile Association last reported 4.24 million shares in the company. Palisades Hudson Asset Mgmt LP reported 16,240 shares or 1.27% of all its holdings. Wellington Shields And Com Llc holds 0.66% or 11,134 shares in its portfolio. Eagleclaw Cap Managment Ltd last reported 70,848 shares in the company. Gilder Gagnon Howe Co Ltd Liability Corp, a New York-based fund reported 30,373 shares. Page Arthur B accumulated 2.69% or 28,008 shares. Koshinski Asset Management owns 35,131 shares or 0% of their US portfolio. Lucas Capital Mngmt holds 59,231 shares or 4.01% of its portfolio. Ally Financial owns 190,000 shares or 3.03% of their US portfolio. Winch Advisory Ser Ltd Liability holds 9.24% of its portfolio in Apple Inc. (NASDAQ:AAPL) for 79,733 shares. Stillwater Cap Advisors accumulated 3.69% or 129,453 shares. First Allied Advisory Incorporated last reported 410,014 shares in the company. Haverford Trust has 839,655 shares for 2.02% of their US portfolio.\n\nInsider Transactions: Since March 30, 2016, the stock had 0 buys, and 20 sales for $135.03 million net activity. WILLIAMS JEFFREY E had sold 26,284 shares worth $2.93M on Friday, April 1. On Tuesday, August 2 the insider KONDO CHRIS sold $1.03M. SCHILLER PHILIP W also sold $2.94 million worth of Apple Inc. (NASDAQ:AAPL) on Friday, April 1. $2.64 million worth of Apple Inc. (NASDAQ:AAPL) was sold by SEWELL D BRUCE on Tuesday, August 16. COOK TIMOTHY D sold $28.70 million worth of stock or 269,883 shares. Riccio Daniel J. also sold $5.30 million worth of Apple Inc. (NASDAQ:AAPL) shares. The insider LEVINSON ARTHUR D sold 70,000 shares worth $7.61M.\n\nMore notable recent Apple Inc. (NASDAQ:AAPL) news were published by: Fool.com which released:  Apple Inc. s Jet Black iPhone Is Ridiculously Hard to Make  on September 26, 2016, also Investorplace.com with their article:  Apple Inc. (AAPL) Is Working to Crack Serious iOS 10 Security Issue  published on September 26, 2016, Fool.com published:  Sorry Apple Inc. Fans   Don t Get Too Excited About the iPhone 7  on September 24, 2016. More interesting news about Apple Inc. (NASDAQ:AAPL) were released by: Valuewalk.com and their article:  Apple Inc. Fighting EU Battle Without Lobbyist Support  published on September 26, 2016 as well as Fool.com s news article titled:  Apple, Inc. Is Still Working on an Amazon  Echo Killer   with publication date: September 23, 2016.\n\nOut of 39 analysts covering Apple Inc. (NASDAQ:AAPL), 35 rate it a  Buy , 0  Sell , while 4  Hold . This means 90% are positive. $200 is the highest target while $102 is the lowest. The $129.29 average target is 14.54% above today s ($112.88) stock price. Apple Inc. has been the topic of 168 analyst reports since July 21, 2015 according to StockzIntelligence Inc. On Wednesday, March 30 the stock rating was upgraded by Longbow to  Outperform . The stock of Apple Inc. (NASDAQ:AAPL) has  Buy  rating given on Thursday, September 15 by BTIG Research. On Wednesday, April 27 the stock rating was maintained by CLSA with  Buy . The rating was maintained by Barclays Capital with  Overweight  on Wednesday, October 28. The company was maintained on Wednesday, July 27 by BMO Capital Markets. As per Tuesday, September 1, the company rating was maintained by Macquarie Research. The firm has  Buy  rating by Nomura given on Wednesday, April 27. The stock has  Buy  rating given by Macquarie Research on Wednesday, April 27. The stock of Apple Inc. (NASDAQ:AAPL) has  Buy  rating given on Friday, September 11 by UBS. RBC Capital Markets maintained the stock with  Outperform  rating in Thursday, January 7 report.\n\nApple Inc. (Apple), incorporated on January 3, 1977, designs, makes and markets mobile communication and media devices, personal computers and portable digital music players and sells a variety of related software, services, peripherals, networking solutions and third-party digital content and applications. The Company s services and products include iPhone, iPad, Mac, iPod, Apple TV, a portfolio of consumer and professional software applications, the iOS and OS X operating systems, iCloud and a variety of accessory, service and support offerings. The Firm offers a range of mobile communication and media devices, personal computing products and portable digital music players, as well as a variety of related software, services, peripherals, networking solutions and third-party hardware and software products. In addition, the Company offers its own software products, including iOS, the Company s mobile operating system; OS X, the Company s Mac operating system; and server and application software. The Company s primary products include iPhone, iPad, Mac, iPod, iTunes, Mac App Store, iCloud, Operating System Software, Application Software and Other Application Software.", "category": "tech", "title": "Investor Market Move: Blackrock Japan Company LTD Stake in Apple INC (AAPL) Has Cut by $10.47 Million as Share Value Declined"}