{"URL": "http://www.wsj.com/articles/irelands-bond-sale-underscores-attractiveness-of-sovereign-debt-1473347304", "body": "Ireland raised money in debt markets at a record-low cost Thursday, despite analysts  concerns that the $14.5 billion tax bill the country must present to Apple Inc. AAPL 0.19 % will hurt its economy.\n\nThe sale underscores how there is little that inhibits investors from buying government debt. Yields on sovereign bonds have remained low amid unprecedented central bank stimulus.\n\n I don t think the Apple tax case will impact people s desire for Irish credit to be honest; sentiment is still largely driven by central bank monetary-policy decisions, which seems to be trumping everything,  said  Mitul Patel, head of rates at Henderson Global Investors.\n\nLast week, the European Commission said that Ireland must recoup $14.5 billion in allegedly unpaid taxes from Apple, because the U.S. tech giant was paying from almost zero to around 1% tax on its European profits between 2003 and 2014.\n\nThe Irish government is appealing a decision that could threaten future investment by U.S. companies looking to sell in Europe and other parts of the world, a central pillar of the country s decades-old growth strategy.\n\nIn a recent report, ratings firm  Moody s Investors Service MCO 0.92 %  warned that the ruling could damage long-term economic growth. Ireland also faces a potential threat if Britain s departure from the European Union results in tariffs between these two big trading partners and a hit to the U.K. economy. The U.K. is Ireland s No. 1 trading partner, making up 17% of both its exports and imports.\n\nStill, investors seem sanguine. Ireland s National Treasury Management Agency sold  1 billion ($1.12 billion) of 10-year bonds at a yield of 0.33%, down from 0.817% at the previous offering in April. That was a record low at that maturity.\n\nSecondary markets, where investors buy and sell previous issues of debt, have also shrugged off concerns. Irish 10-year government bonds are yielding around 0.38%, compared with 0.44% on the day before the Apple decision was announced.\n\nYields on government bonds across the developed world have plummeted, many into negative territory, as central banks buy sovereign debt and expectations remain low for the inflation that would erode the value of these investments. Yields fall as prices rise.\n\nThat is bringing down the cost of raising money for governments and allowing even countries with lower credit ratings and weaker growth prospects to raise cash at ever longer maturities. Spain, Belgium and France have all sold 50-year bonds in public markets. Italy is talking to investors about its own debut 50-year issue, and is able to despite market concerns about the country s economic growth, banks and a coming, potentially market-rattling referendum.\n\nIreland and Belgium have both sold  100 million of 100-year bonds in privately placed deals this year.\n\nAnd as the yields on developed-market bonds fall, investors are looking farther afield in their quest for returns. That has pushed the benefits of this current yield compression out to emerging markets.\n\nOn Thursday, a $750 million bond from Ghana received a lot of demand as investors were attracted to the roughly 9.25% yield, according to a fund manager familiar with the deal.\n\nWrite to Paul Hannon at paul.hannon@wsj.com and Jon Sindreu at jon.sindreu@wsj.com", "category": "tech", "title": "Ireland s Bond Sale Underscores Demand for Sovereign Debt"}