{"URL": "http://www.investopedia.com/news/why-boe-may-buy-apple-ge-att-debt-aapl-t/", "body": "The measures the Bank of England is willing to use to stimulate the economy is illustrated by the list of U.S. companies in its corporate bond-buying program that includes Apple Inc. (AAPL), AT&T Inc. (T), General Electric Co. (GE), Verizon Communications Inc. (VZ) and Wal-Mart Corp. (WMT) to name just a few.\n\nThese five are among 100 companies that the BOE plans to choose from to purchase 271 different securities totaling $13.3 billion of corporate bonds. Many of the eligible bonds are issued by non-British companies, including American companies that have large operations in the UK. (See also: Amazon Bets Big on Post-Brexit Britain.)\n\nThe objective of the stimulus is to lower yields on sterling corporate bonds in order to encourage corporate lending and boost the economy. The effort is a part of a bigger stimulus program in place to prevent the uncertain UK economy from falling into a post-Brexit recession.\n\nThe bond-buying program, or the Corporate Bond Purchase Scheme (CBPS), was announced earlier this year. In addition to U.S. companies, the BOE list also includes utility company  lectricit  de France, and Daimler AG, the German auto maker.\n\nThe BOE has specific goals in its buying strategy. If corporate yields go down, that effectively makes it cheaper for companies to borrow money. If a company has access to cheap capital, the assumption is it will reinvest the capital which will, on a larger scale, lead to economic growth and more jobs. This may be more effective than asset purchases because it's projected to bring down the corporate yield, making capital cheaper for everyone.\n\nThe risk is that companies will not reinvest, and rather do stock buybacks and pay out dividends. (See also: The Keynesian Put: New Support For Asset Prices.)\n\nOpponents of the program have criticized the central bank for expanding capital injections to foreign companies when they simply may not make any new investments in the UK. Foreign companies may be more inclined to invest in their home country or pay dividends to its shareholders. Samuel Tombs, the chief U.K. economist at Pantheon Macroeconomics told the Wall Street Journal that  What they can t do is trace where the money goes,  regarding the BOE.\n\nAccording to the statements released by the BOE, a company is eligible to be on the list if it makes  a material contribution to economic activity in the UK.  This requirement will be considered as met if the company has  significant employment in the UK or with their headquarters in the UK. \n\nThe standards are very similar to the requirements the Bank of Japan set for its stimulus program back in 2010. The difference, however, is that BoJ invested in ETFs following indices tracking similar companies, not corporate bonds.", "category": "tech", "title": "Know Why BoE's Buy List Includes Apple, GE (AAPL, GE)"}