{"URL": "http://www.smarteranalyst.com/2016/09/27/merrill-lynchs-tale-two-tech-giants-apple-inc-aapl-alphabet-inc-googl/", "body": "Merrill Lynch analysts shine light on two of the tech-verse s top giants: Apple Inc. (NASDAQ:AAPL) and Alphabet Inc (NASDAQ:GOOGL). Both analysts remain bullish, despite concerns sparked by third party data indicating the iPhone 7/7 Plus launch s first weekend sales saw a decline from past launches and despite apprehension amidst overcoming a tougher second half of 2016 revenue comp, respectively. Let s take a closer look:\n\nThe rumor mill is churning once again, with Apple Inc. s newest iPhone upgrade launch as the continuing hot topic of conversation. Yet, this past Friday, recent sellout data emerged from a third party source suggesting iPhone 7/7 Plus sales had taken a 25% drop in year-over-year in International markets for the opening launch weekend.\n\nHowever, Merrill Lynch analyst Wamsi Mohan believes this to not be a  good indicator of demand,  and therefore reiterates a Buy rating on shares of AAPL with a $125 price target, which represents a nearly 11% increase from where the stock is currently trading.\n\nFrom Mohan s perspective,  In our opinion this data is not representative of true demand as our conversations indicate that the data does not account for several factors including (1) Apple store, (2) online sales, (3) supply constraints, (4) comparability of data. Apple may have allocated more supply to U.S. locations in general, and/or to its own retail stores in other countries vs. to other outlets. We would view the pullback in shares as a particularly attractive opportunity and reiterate our Buy rating. \n\nAs far as the analyst is concerned,  In our opinion the first weekend of data is usually quite noisy.  For Mohan, more importantly,  Apple stores and Online remain important sales channels  and as such, the analyst remains undeterred in his positive viewpoint on the giant.\n\nAccording to TipRanks, which measures analysts  and bloggers  success rate based on how their calls perform, four-star analyst Wamsi Mohan is ranked #1,102 out of 4,183 analysts. Mohan has a 59% success rate and gains 3.6% in his annual returns. When recommending AAPL, Mohan realizes 3.6% in average profits on the stock.\n\nTipRanks analytics exhibit AAPL as a Strong Buy. Based on 36 analysts polled in the last 3 months, 31 rate a Buy on AAPL, 4 maintain a Hold, while 1 issues a Sell.\n\nAlphabet Inc is well aware it has a tougher second half of 2016 revenue comp this time around than third quarter just this last year, and Merrill Lynch top analyst Justin Post notes having had  higher investor interest  in third and fourth-quarter expectations.\n\nThough the analyst predicts ex-forex Google Website growth will face a 28% year-over-year decline in Alphabet s second-quarter, he does see the deceleration improving to a 25% drop year-over-year in third-quarter, and 21% dip year-over-year by fourth-quarter.\n\nWhile Post acknowledges the  tough comp,  the analyst maintains that with new ad initiatives underway, GOOGL should be able to offset its obstacles. Moreover, Post notes that despite  mixed  initial feedback from advertiser checks,  overall trends [remain] solid. \n\nAs such, the analyst reiterates a Buy rating on GOOGL with a price target of $960, which represents just under a 20% increase from where the shares last closed.\n\n Overall, mobile usage remains a positive tailwind and we see enough offsetting drivers (4th link, Maps, PLAs) to limit overall growth deceleration. We think some investors are likely on the sidelines for Google (Google stock up 4% YTD despite upside to estimates vs NASDAQ up 6%) due to concerns on the tougher 2H comps, and the Street would react favorably to an in-line to slightly ahead quarter. Looking out five months from now, we think sentiment can improve as we estimate Google will still be growing Website revenue around 19% and the street will be looking forward to easier comps,  Post concludes.\n\nAs usual, we like to include the analyst s track record when reporting on new analyst notes to give a perspective on the effect it has on stock performance. According to TipRanks, top five-star analyst Justin Post has achieved a high ranking of #15 out of 4,183 analysts. Post upholds a 76% success rate and garners 19.7% in his yearly returns. When recommending GOOGL, Post earns 27.7% in average profits on the stock.\n\nTipRanks analytics demonstrate GOOGL as a Strong Buy. Based on 32 analysts polled in the last 3 months, 31 rate a Buy on GOOGL, while 1 maintains a Hold. The consensus price target stands at $946.12, marking a nearly 18% upside from where the stock is currently trading.", "category": "tech", "title": "Merrill Lynch's Insights: Apple Inc. (AAPL), Alphabet Inc (GOOGL)"}