{"URL": "http://www.investopedia.com/news/nasdaq-amazon-facebook-hit-alltime-highs-aapl-amzn/", "body": "The Nasdaq Composite Index hit a record high of 5,275.91 at close Tuesday, following up a handful of all-time highs in August. The tech-heavy index rose 0.5% from its close before the holiday weekend, driven by Amazon.com Inc. (AMZN) and Facebook Inc. (FB), both of which also logged new record closing prices at $788.87 and $129.73, respectively.\n\nApple Inc. (AAPL) closed down a hair, suggesting that markets are not thrilled by the prospect of Wednesday's iPhone 7 unveiling.\n\nThe PowerShares QQQ ETF (QQQ), which tracks the Nasdaq 100, is up 0.6% to $117.85. The ETF has returned 6.0% year-to-date.\n\nIn a return to a now-familiar good-news-is-bad-news pattern, U.S. stocks have benefited from a disappointing jobs report Friday. The economy added 151,000 non-farm payrolls in August, significantly lower than the 175,000 consensus estimate gathered by Bloomberg and the prior month's revised result of 275,000 jobs. (See also, Jobs Report Leaves Rate Hike on Table.)\n\nThe soft data convinced many traders that the Federal Reserve would hold off raising rates at its September meeting. According to the CME Group's FedWatch tool, markets give the probability of a September rise to a target range of 50-75 basis points   from the current 25-50   at just 21%. That estimate remains low despite a run of hawkish Fed chatter that culminated in a speech by Janet Yellen in Jackson Hole, in which she said the case for a rate rise had been \"strengthened.\" (See also, Raising Rates Now Will Lead to Economic Slowdown.)\n\nThe Nasdaq is probably not reaching all-time highs on the strength of a slightly-delayed rate hike alone. Some other force is at work, and chances are it's TINA. Short for \"there is no alternative,\" the acronym expresses investors' reluctant embrace of stocks' despite having no compelling near-term reason to invest. The reason is that they look around, see rock-bottom   even negative   bond yields, illiquid and overheated private equity and real estate markets, and decide that stocks are a better bet than cash or gold.\n\nBen Willis of Princeton Securities told Cheddar as much in July, and little appears to have changed since then.\n\nDisclosure: The author has long positions in Amazon and Apple.", "category": "tech", "title": "NASDAQ, Amazon, Facebook Hit All-Time Highs (AAPL, AMZN)"}