{"URL": "http://investorplace.com/2016/09/stock-market-today-nyse-dow-jones-industrial-average-investing-news-6/", "body": "U.S. equities finished strongly on Thursday, rebounding after two days of losses to return to the highs seen on Monday. There was no clear catalyst for the rise, just a feeling that some of the fear surrounding the recent rise in long-term bond yields was perhaps overblown as the Federal Reserve remains unlikely to raise interest rates next week.\n\nAdding to the positivity was another 3.4% gain in Apple Inc. (NASDAQ: ), which is up nearly 13% from its post-iPhone 7 low last week on positive anecdotal evidence of demand for its new handset and ongoing problems for competitor Samsung Electronics (OTCMKTS: ) over exploding Galaxy Note 7s. Nothing like a barbequed cell phone to get the buyers excited.\n\nIn the end, the Dow Jones Industrial Average gained 1%, the S&P 500 Index gained 1%, the Nasdaq Composite gained 1.5% and the Russell 2000 gained 1.3%. Treasury bonds were mixed, the dollar weakened against the yen, gold lost 0.6% and oil gained 0.8% providing to relief to energy stocks. Ongoing weakness in Treasury bonds pushed up the ProShares UltraShort Treasury (NYSEARCA: ) to a gain of 9.1% so far this month for Edge subscribers.\n\nTechnology issues led the way with a 1.7% gain followed by healthcare, up 1.1%. Materials and financials were the laggards, up 0.6%. In addition to the strength in Apple, supplier stocks like Skyworks Solutions Inc (NASDAQ: ) and Cirrus Logic, Inc. (NASDAQ: ) rose in sympathy with gains of 6.4% and 7.6%, respectively.\n\nThe economic calendar was buys. Retail sales fell 0.3% in August vs. expectations for a 0.1% decline, marking the first drop in five months. Headline producer price inflation was weaker than expected. The Empire State manufacturing activity index was weak, but the Philly Fed manufacturing index grew more than expected. Initial weekly jobless claims were largely unchanged.\n\nAnd Industrial production fell 0.4% in August from July, worse than the 0.2% drop that was expected.\n\nFor now, the largest single motivator for stocks remains the odds of a Fed interest rate hike this year. With odds of a September hike falling to just 9%, and the odds of a December hike falling to 45%, investors are suddenly feeling better about the prospect for higher prices into the end of the year.\n\nPersonally, I continue to look for a nice rally to fresh highs before darkness returns in October ahead of the Q3 earnings season, the approaching U.S. presidential election, and the realization that maybe, just maybe, the Fed could issue a surprise post-election hike just before Christmas.\n\nAnthony Mirhaydari is founder of the Edge and Edge Pro investment advisory newsletters. A two-week and four-week free trial offer has been extended to InvestorPlace readers.", "category": "tech", "title": "Stocks Rebound as Apple Inc. Continues Surging"}