{"URL": "http://www.investors.com/market-trend/stock-market-today/stocks-spooked-by-ecb-news-apple-nike-weigh-on-dow/", "body": "Major averages were down in late-morning trade Thursday but off session lows. The European Central Bank, as expected, opted to leave interest rates unchanged. The U.S. dollar lost ground and the euro rallied against other currencies after Mario Draghi acknowledged the ECB did not discuss an extension of the current bond-buying program.\n\nEarly laggards in the Dow Jones industrial average included Apple (AAPL) and Nike (NKE), hurt by downgrades, while Liberty Media (LMCA) outperformed in the Nasdaq 100.\n\nThe Nasdaq fell 0.3%, while the Dow lost 0.2% and the S&P 500 0.1%.\n\nU.S. oil prices jumped nearly 4% to above $47 a barrel after the Energy Information Administration reported that U.S. crude inventories fell by a huge 14.5 million barrels.\n\nLiberty Media lost nearly 1% after announcing a cash and stock deal to acquire Delta Topco, the parent company of London-based Formula One Group, for around $4.4 billion. Following the acquisition, Liberty Media will change its name to the Formula One Group and trade under the ticker FWON.\n\nShares of Apple were down more than 2% after Wells Fargo downgraded shares to market perform. Nike lost about 1.5% on a Piper Jaffray downgrade to neutral.\n\nIn the stock market today, Hewlett Packard Enterprise (HPE) gave up nearly 2% as Wall Street mulled its latest earnings report. Adjusted earnings per share topped expectations, but sales fell 6% to just over $12.2 billion.  The company also announced plans to sell its software business to U.K.-based Micro Focus for $8.8 billion. HPE is still in position for a breakout try over a 22.30 entry. Shares were recently trading around 21.98.\n\nIBD'S TAKE: HPE's tech service industry group is home to plenty of leading growth stocks. See why it's important to focus on leaders, rather than laggards, in IBD University.\n\nGigamon (GIMO) help up well in the IBD 50, rising 0.3%. It's getting support at its 10-week moving average for the first after a breakout from a cup-shaped base in June.\n\nHewlett Packard Enterprises Keeps Slimming, But Where's The Beef?", "category": "tech", "title": "Stocks Fall On ECB, Apple, Nike; Oil Prices Rally"}