{"URL": "http://www.investors.com/news/stocks-to-watch-are-apple-facebook-alphabet-still-buys/", "body": "Three tech giants are stocks to watch this week as Apple (AAPL) remains in buy range while Facebook and Google owner Alphabet struggle to stay within their buy zones.\n\nApple shot up 3.5% in heavy volume on Sept. 14 to clear a buy point at 110.33 amid higher-than-expected demand for the iPhone 7. With the stock down 1.9% to 112.73  for the week, shares still remained within the 5% buy range.\n\nApple lost about 1% before Monday's opening bell but closed up 0.15% at 112.88 on the stock market today.\n\nThe social networking leader fell 1.6% to 127.96 Friday on reports that it miscalculated the average time users spent watching videos   impacting advertisers.\n\nFacebook (FB) dropped back below buy range from a flat base with an entry at 128.43. Facebook finished 0.5% lower Monday at 127.31.\n\nIBD'S TAKE: With its outstanding fundamental and technical performance, Facebook earns a spot on the IBD 50 list of leading growth stocks. What other top names join its ranks? Check out Leaderboard to find out.\n\nAfter breaking out of a base with an 813.98 buy point in Thursday's session, Alphabet (GOOGL) remained within the buy zone Friday despite dipping 0.1% Friday to 814.96 in light volume. But Alphabet fell 1.5% to finish at 802.65.\n\nThe action comes as CNBC reported Friday that Alphabet's Google and Salesforce (CRM) may be potential buyers Twitter (TWTR).\n\nThe exchange operator surged 20% Friday in giant volume after reports late Thursday said CBOE Holdings (CBOE) was in talks to acquire Bats Global Markets (BATS).\n\nShares jumped to a new high, as the Relative Strength Line also hit new high ground, and well past a 29.11 buy point from a consolidation base.\n\nAs it turned out, the reports were true. CBOE is buying Bats for $3.2 billion, the companies said Monday. Bats fell 4.6% to 30.33.", "category": "tech", "title": "Stocks To Watch: Are Apple, Facebook And Alphabet Still Buys?"}