{"URL": "http://sports.yahoo.com/news/shares-crumble-oil-falls-bond-011357010.html", "body": "NEW YORK (Reuters) - The U.S. Treasury yield curve hit its steepest in more than two months on Wednesday, while world stock markets edged lower as investors fretted about future U.S. interest rate hikes.\n\nA jump in Apple (AAPL.O) shares, which briefly touched a 2016 high, limited losses in the S&P 500 index.\n\nDeepening worries over the ability of the world's major central banks to stimulate growth have triggered a rise in bond yields and sparked a bout of risk-off trading.\n\nSpeculation about the timing of the Federal Reserve's next interest rate hike also has shaken investors following contrasting comments from Fed officials, even though interest rate futures indicate expectations for a rate hike at the U.S. central bank's Sept. 20-21 meeting are still low.\n\n\"What you're seeing is a little preview for what will happen when the Fed does raise rates,\" said Chris Zaccarelli, chief investment officer at Cornerstone Financial Partners. \"People are starting to make changes to their portfolios.\"\n\nInvestor optimism over the newest iPhone drove Apple shares up 3.5 percent to $111.77 and limited losses in U.S. stocks. Apple's market value peaked above $600 billion for the first time since April as Wall Street bet the technology company's newest iPhone would help shore up falling sales.\n\nThe Dow Jones industrial average (.DJI) ended down 31.98 points, or 0.18 percent, to 18,034.77, the S&P 500 (.SPX) closed off 1.25 points, or 0.06 percent, to 2,125.77 while the Nasdaq Composite (.IXIC) added 18.52 points, or 0.36 percent, to 5,173.77.\n\nMSCI's all-country world stock index <.MIWD00000PUS> was down 0.1 percent, while European shares (.FTEU3) also ended down 0.1 percent.\n\nBayer (BAYGn.DE) closed off its highs after clinching a $66 billion deal to buy Monsanto (MON.N). Monsanto shares were up 0.6 percent at $106.76.\n\nEuro zone bond yields rose across the board after European Central Bank Executive Board member Sabine Lautenschlaeger said the bank should hold off on new monetary easing measures.\n\nIn the U.S. market, recent bond weakness ebbed on Wednesday after a dramatic selloff on Tuesday sent long-dated yields to three-month highs.\n\nBenchmark 10-year notes ended up 13/32 in price to yield 1.69 percent, down from 1.73 percent on Tuesday.\n\nStill, the gap between five-year note yields and 30-year bond yields widened to 125 basis points, the steepest curve since July 1.\n\nU.S. long-dated bonds have underperformed in the past month, in line with a steepening yield curve in Japanese government bonds.\n\nThe U.S. dollar eased from an eight-day high against the yen as skepticism grew that the Bank of Japan would intensify its stimulative monetary policies next week.\n\nThe dollar eased from a session high of 103.34 yen touched in early trading and was last down 0.18 percent against the Japanese currency at 102.35 yen (JPY=).\n\nOil prices fell, extending recent losses, after data showed large weekly builds in U.S. petroleum products that overshadowed a surprise draw in crude stockpiles.\n\nBrent crude futures (LCOc1) fell $1.25, or 2.7 percent, to settle at $45.85 per barrel, while U.S. crude (CLc1) slid $1.32, or 2.9 percent, to settle at $43.58.", "category": "tech", "title": "Stocks dip, U.S. yield curve hits steepest in two months"}