{"URL": "http://seekingalpha.com/article/4007144-treasuries-scary-buy-apple-bonds-instead", "body": "Most readers are aware that U.S. Treasuries have been a great investment over the past 10 and 20 years. With interest rates on a constant downtrend over this time frame, the value of risk-free Treasury bonds continued to climb year after year. For example, the Vanguard Intermediate Term Treasury Fund (MUTF:VFITX) has returned about 5% per year in the past 10 years, and 6% since inception in 1991 (see chart below) - excellent for what defines a risk-free investment.\n\nMost investors consider past performance to make investment choices. The results for Treasuries would support continued investment in this sector; however, in this case, past performance is truly not indicative of likely future results. Interest rates have been on the decline for many years, fueling returns in Treasuries that is far outpacing the actual stated yield of the bonds. As seen in the chart below, the 10-year Treasury rate declined from 4%-5% in 2007-2008 to today's sub-2% levels. The 10-year Treasury rate today stands at about 1.7% - how will it be possible to generate 4% to 6% returns on these bonds going forward, or even 2% to 3% returns? The only way this could happen is with further declines in interest rates fueling increases in Treasury bond prices.\n\nMy view is that future interest rate declines are unlikely, and impossible at the magnitude of previous declines unless they go deep into negative territory. While I am not calling for a rapid rise in rates, and rates may in fact stay at these low levels for many more years, the chances of further declines is far outweighed by the likelihood of rate increases, which will hurt returns on Treasuries.\n\nIn my view, Treasuries are not attractive today and possibly toxic, as the opportunity cost of locking in very low rates for 5 years, 10 years and longer can be high. Treasuries will struggle to earn more that their stated yield, and in fact, may show losses if rates begin to creep up (which will then require investors to hold their bonds to maturity to realize even the stated bond yield). This reality has negative implications for \"robo advisors\" and other investment models which automatically allocate significant assets to Treasuries. If one believes rates are headed lower, then by all means continue to buy Treasuries, but realize that while the credit risk might be zero, the interest rate risk is elevated.\n\nSo what is the alternative for investors seeking an ultra-safe place to park their cash outside of a bank account or CD? The alternative is what I call \"Super High Grade\" corporate bonds. While by definition higher risk than U.S. government obligations, the credit risk of these companies is virtually zero in my view, especially for the time horizons noted. Here are some ideas:\n\nJPMorgan Chase (NYSE:JPM) - 2.55% of 10/29/2020 (about 4 years), priced at 102.1 to yield 2.0%, rated A3/A-. CUSIP 46625HNX4.\n\nWells Fargo Bank (NYSE:WFC) - 2.5% of 3/4/2021 (about 4.5 years), priced at 102.0 to yield 2.0%, rated A2/A. CUSIP 949746RS2.\n\nGeneral Electric (NYSE:GE) - 2.125% of 12/15/2020 (about 4.25 years), priced at 101.3 to yield 1.8%, rated A1/AA+. CUSIP 36966TLD2.\n\nAnd then to the Apple bonds (TICKER: AAPL), rated Aa1/AA+. Their 1.55% 8/4/2021 bonds, or just under 5 years (CUSIP 037833CC2) are available at 99.8 to yield 1.6%.\n\nThere are other choices from these highest quality investment grade bonds. The main theme is to keep it short, since at these yield levels, I would never want to go past 5 years. Shifting allocations from Treasuries to these type of bonds will significantly reduce interest rate risk and boost yields for what is, in my opinion, a virtually zero increase in credit risk.\n\nDisclosure: I do not own bonds in the issues noted since the low yields do not fit my personal investment strategy. These bond issues have been purchased for client accounts.\n\nPlease consider Downtown Investment Advisory's subscription service through Seeking Alpha, The High Yield Bond Investor. The newsletter offers deep analysis of three recommendations per month, focused on yields in the 6%-8% range for the buy-and-hold investor, as well as regular exclusive insights on this asset class as well as related investments such as Exchange Traded Debt and Term Preferred Stock. We seek to uncover undervalued and \"off the radar\" opportunities. Please see our profile page for important disclaimers.\n\nDisclosure: I/we have no positions in any stocks mentioned, and no plans to initiate any positions within the next 72 hours.\n\nI wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.", "category": "tech", "title": "Treasuries Are Scary - Buy Apple Bonds Instead"}