{"URL": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNGAoQWUGyY9bRPVc_oYVexsr_07ug&clid=c3a7d30bb8a4878e06b80cf16b898331&ei=PNDqV6DdFY_Q3QGnyqfoDg&url=http://www.smarteranalyst.com/2016/09/26/nomura-bumps-price-target-apple-inc-aapl-heres/", "body": "Analysts offer insights into a tale of two technology giants: Apple Inc. (NASDAQ:AAPL) and Twitter Inc (NYSE:TWTR). On one end, the analyst rides the AAPL bullish train full steam ahead with a price target boost amid a demand performing better than expectation; on the other, TWTR is about to be sold and an analyst downgrading in the wake of a sudden bearish perspective. Let’s take a closer look:\n\nApple is benefiting from a tide of “steady positive news across geographies on the iPhone 7 launch,” from the U.S. to the UK to Japan, with stellar early demand. The demand has been impressive and Nomura analyst Jeffrey Kvaal believes the “launch implies demand is stronger than thought” initially.\n\nAs such, Nomura lifts high-end iPhone estimates and reiterates a Buy rating on shares of AAPL, while lifting the price target from $120 to $135, which represents a nearly 20% increase from where the stock is currently trading.\n\nIn the beginning, carriers in the U.S. anticipated demand for the iPhone 7 would “restore industry upgrade rates” from about 6% in the first half of 2016, the same rates of 6s levels in the second half of 2015. From Kvaal’s perspective, “We believe demand is ahead of this pace, if not to the 10% upgrade rate from the iPhone 6 cycle.”\n\nFurthermore, the analyst believes that the strength of the iPhone 7 demand is actually about “more than the appeal of the phone itself,” noting that this time around in comparison to carrier strategy in 2015, promotions are “more aggressive,” with Samsung’s “travails of the Note 7” serving to bolster the tech giant’s success all the more.\n\nKvaal asserts, “We believe the supply chain is preparing for upward revisions to production forecasts.”\n\nThe analyst boosts his EPS estimate for the fiscal year of 2017 from $9.10 to $9.30, “primarily on higher iPhone volumes.” Additionally, Kvaal projects 78 million iPhone units for the fiscal first quarter, which tops the Street’s expectation of 75 million. Kvaal also raises his fiscal year of 2017 estimate from 230 million to 234 million, also ahead of the Street at 221 million.\n\n“We believe Apple has sensibly managed the price/cost to keep its gross margin structure in balance,” Kvaal concludes.\n\nAs usual, we like to include the analyst’s track record when reporting on new analyst notes. According to TipRanks, five-star analyst Jeffrey Kvaal is ranked #313 out of 4,183 analysts. Kvaal has a 61% success rate and earns 12.0% in his annual returns. When recommending AAPL, Kvaal earns 9.1% in average profits on the stock.\n\nTipRanks analytics exhibit AAPL as a Strong Buy. Based on 36 analysts polled in the last 3 months, 31 rate a Buy on AAPL, 4 maintain a Hold, while 1 issues a Sell. The 12-month price target stands at $127.83, marking a 13% upside from where the shares last closed.\n\nOn the heels of media reports that Twitter is on the verge of a sale, the stock shot up 21% on Friday, while adding 3% today. From Oppenheimer analyst Jason Helfstein‘s perspective, it is a “buyer beware” era for Twitter investors, and therefore downgrades from a Market Perform to an Underperform rating on shares of TWTR with a $17 price target, which represents a 27% downside potential from where the stock is currently trading.\n\nIn the midst of waning user growth, “poor” product implementation and execution, declining user engagement, “inferior” advertising technology, problematic platform safety, and a fierce environment of competition, the analyst becomes bearish on the troubled social media titan.\n\nFor instance, Helfstein explains that the TWTR user interface lacks accessibility with its challenging learning curve, which in turn thwarts new users from joining the Twitter-verse. Additionally, with competitors like Snapchat’s Snap Audience Match and Pinterest’s recent launch, an upgraded Promoted Pins, Helfstein warns, “We believe these investments will cause Twitter to lose share to these emerging platforms in 2017.”\n\nAs Helfstein assesses the situation, “We believe a media company is the most likely purchaser and would not pay meaningfully more than the valuation implied by our price target. Last, we see no meaningful increase in engagement from the Olympics or the NFL games, further diminishing the probability of a deal.”\n\n“We believe that Twitter is overvalued compared to its peers, and is already discounting a take-out premium. Moreover, any acquirer would have to cash out employee options and make large capital investments to improve the user experience and advertising technology,” Helfstein concludes.\n\nAccording to TipRanks, which measures analysts’ and bloggers’ success rate based on how their calls perform, five-star analyst Jason Helfstein is ranked #161 out of 4,183 analysts. Helfstein has a 57% success rate and gains 10.3% in his annual returns.\n\nTipRanks analytics exhibit TWTR as a Hold. Based on 33 analysts polled in the last 3 months, 6 rate a Buy on TWTR, 21 maintain a Hold, while 6 issue a Sell. The 12-month price target stands at $17.85, marking a nearly 22% downside from where the shares last closed.", "category": "tech", "title": "Wall Street Analysts Dial Up the Price Target on Apple Inc. (AAPL), Drop the Rating on Twitter Inc (TWTR)"}