{"URL": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNEXFPwbFQot_GQND3lPncMkoemLGg&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52779224063605&ei=Cc7qV9mXNJPJ3gGStZXAAQ&url=http://qz.com/793077/coming-soon-to-the-apple-aapl-watch-sleep-tracking-somehow/", "body": "Earlier this month, Apple unveiled the new (and slightly improved) Apple Watch. The new version is waterproof and comes in new materials, but it still has roughly the same size, battery life, and screen quality. Even still, Apple is looking to bring new functionalities to the second version of the watch, according to a report from Bloomberg—some of which are rather difficult to believe.\n\nThe Apple Watch has a battery life of about 18 hours, meaning that most people tend to leave their watches charging on their nightstand overnight. The watch even has a nifty feature that turns the watch into a tiny alarm clock as it charges. But according to Bloomberg, Apple is working on a way to use the watch to track users’ sleeping habits, which many other fitness trackers on the market do. However, those devices last for days at a time on a single charge. Given that the Apple Watch doesn’t last through the night, and also is considerably bulkier than the average FitBit or Jawbone tracker (and probably uncomfortable to sleep in), it’s not entirely clear how Apple intends to leverage the existing watch into something that could track sleep. If you were to use it as a sleep tracker, you’d need to charge it during the day, meaning you’d lose its other functions during your waking hours. That would seem to run counter to why you bought the device in the first place. (The company wasn’t immediately available for comment.)\n\nThe report also suggested that Apple is working on other new software features for the watch, such as a fitness tracker that measures how quickly your heart rate rises and falls during and after exercise, as well as new applications for its health-tracking data system, HealthKit. Apple launched HealthKit in 2014, and has hinted in the past that it wants to use the information its wearables and smartphones can collect to inform doctors about their owners’ health. CEO Tim Cook has said the company would potentially be open to creating another wearable—not the Apple Watch line, but something simpler—that the company could run through government compliance tests, and could theoretically allow patients to share data from a personal device with their doctor.\n\nAs Bloomberg points out, the global health-care industry is a roughly $8 trillion market. A slice of that could definitely help Apple with slowing iPhone sales and underwhelming reviews of its newest gadgets.", "category": "tech", "title": "Apple is working on a sleep tracker for the Apple Watch—even though that seems completely impractical"}