{"URL": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNGlVKXNEe1Wp-tCgueYeYmD3iTiaA&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52779216122340&ei=Cc7qV9mXNJPJ3gGStZXAAQ&url=http://investorplace.com/2016/09/apple-inc-aapl-stock-upgrade-rbc-capital/", "body": "Apple Inc. (NASDAQ: ) was upgraded by RBC Capital on Thursday morning, marking yet another analyst who has patted AAPL stock on the back since the unveiling of the iPhone 7.\n\nAnalyst Amit Daryanani lifted his price target on Apple stock to $125 from $120, citing results of a survey that showed iPhone 7 should drive an increase in average selling prices (ASPs).\n\nFrom the analyst’s note to clients:\n\nThe analyst’s new target price gives AAPL stock implied upside of 10% in the next year or so. Additionally, Daryanani affirmed his rating of “Outperform” (buy, essentially).\n\nUPDATE: RBC’s upgrade comes a day after UBS lifted its own target price on Apple stock. The firm now sees AAPL hitting $127 in the next 12 months or so, up from a prior target of $115.\n\nAs for RBC, Daryanani says that surveys show that 46% of respondents plan to buy the larger 5.5” iPhone across 6S+ and 7+ models. These larger models sport higher selling prices and margins.\n\nRBC’s survey also suggests there could be stability in the iPhone replacement cycle or that at least it will elongate at a slower pace. That’s an important development for Apple as customers are holding on to their old phones for longer periods of time.\n\nLastly, more respondents say they intend to purchase or use ancillary products and services such as Apple Watch or Apple Pay.\n\nOverall, analysts’ average price target on AAPL stock stands at $125. Although implied upside of 10% or more is usually good for a buy rating, it’s right on the border with hold.\n\nApple stock is up nearly 8% for the year-to-date to beat the S&P 500 by 2 percentage points. Much of that is due to a better-than-expected response to iPhone 7, which by many estimates was supposed to be something of a flop.\n\nNot all analysts are as sanguine as RBC or UBS, of course. JPMorgan analysts believe that the demand surge for iPhone 7 isn’t sustainable. The analyst fears that it’s being driven by unusually aggressive promotional activities by the major carriers, such as free upgrades and trade-in deals.\n\nAnd that’s understandable. No one blames analysts and investors for being skeptical of the latest iteration of the iPhone. It’s still not clear if the initial consumer reaction can be sustained.\n\nBut make no mistake — the iPhone 7 is a win for the bulls over the bears so far. The outlook for AAPL stock hasn’t been this bright all year long.\n\nAs of this writing, Dan Burrows did not hold a position in any of the aforementioned securities.", "category": "tech", "title": "Apple Fever! AAPL Stock Gets Yet Another Upgrade"}