{"URL": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNGDFvL1fg-yeRQsNgLvPR12RzifOA&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52779213099431&ei=Cc7qV9mXNJPJ3gGStZXAAQ&url=http://www.cnbc.com/2016/09/16/early-movers-twtr-db-aapl-xom-nvax-lulu-more.html", "body": "Check out which companies are making headlines before the bell:\n\nTwitter — Twitter shares rose about 3 percent in the premarket trading after successfully streaming a National Football League game Thursday night.\n\nNovavax — The vaccine developer's shares plummeted 86 percent in the premarket after saying its experimental respiratory vaccine failed an important study. Analysts at Piper Jaffray also cut their price target on the stock to $1 from $14 and downgraded the stock to \"neutral\" from \"overweight.\"\n\nDeutsche Bank — The German banking giant saw its U.S.-listed shares fall more than 9 percent after the U.S. Justice Department asked it to pay $14 billion to settle several investigations related to mortgage securities. Deutsche Bank said in a statement it \"has no intent to settle these potential civil claims anywhere near the number cited.\"\n\nApple — Apple shares were up more than 10 percent for the week heading into Friday trading as the iPhone 7 launched around the world amid strong sales.\n\nExxonMobil — The New York attorney general said he is investigating the oil giant's accounting practices and questions why the company hasn't written down the value of its assets despite a steep drop in oil prices, according to The Wall Street Journal.\n\nLululemon Athletica — Susquehanna initiated coverage of the stock with a positive rating and $77 price target, a more than 16 percent upside from Thursday's close. The firm noted more compelling offerings, a great culture of consumer engagement, and realization of operational efficiencies.\n\n\n\nIntel — The company raised its third-quarter revenue outlook to $15.6 billion, plus or minus $300 million, from the previous range of $14.9 billion, plus or minus $500 million, based on restocking of the PC supply chain inventory. Intel also noted some signs of improving PC demand. Shares were more than 4 percent higher in premarket trade.\n\n\n\nCiti — Goldman Sachs downgraded the stock to \"neutral\" from \"buy\" in favor of reiterating a \"buy\" on Bank of America. Goldman also removed Citi from its buy list and cited the failure of earnings to recover and return on equity below management's target.\n\n", "category": "tech", "title": "Early movers: TWTR, DB, AAPL, XOM, NVAX, LULU & more"}