{"URL": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNG1JGB8VKXbKAufUERoSPAClJKmfw&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52779217795481&ei=Cc7qV9mXNJPJ3gGStZXAAQ&url=http://www.cnbc.com/2016/09/21/early-movers-gis-dgx-wfc-rai-skx-msft-aapl-kbh-more.html", "body": "Check out which companies are making headlines before the bell:\n\nGeneral Mills — The food producer earned an adjusted 78 cents per share for its fiscal first quarter, three cents a share above estimates. Revenue was essentially in line, however the company said its sales performance didn't meet its own expectations, owing to a challenging macroeconomic environment and other factors.\n\nQuest Diagnostics — The medical lab operator unveiled a new antibody test service that helps medical professionals diagnose infection by the Zika virus. Quest is using a test developed by the Centers for Disease Control and Prevention.\n\nWells Fargo — JPMorgan Chase downgraded the bank to \"neutral\" from \"overweight,\" saying that scrutiny of Wells Fargo is likely to ramp up after this week's Senate hearings into fraudulent sales practices.\n\nReynolds American — Jefferies began coverage on the tobacco producer with a \"buy\" rating, pointing to factors like cost savings and continuing development of vapor-based products.\n\nBoston Beer — William Blair initiated coverage on the beer brewer with an \"outperform\" rating, due to its presence in the fast-growing craft beer segment.\n\nSkechers — Morgan Stanley downgraded the footwear maker to \"equal-weight\" from \"overweight,\" saying consumer tastes in athletic footwear are shifting towards more fashionable offerings and that an adjustment by Skechers in its offerings is leading to slower sales growth.\n\nMicrosoft — The software giant announced a dividend hike and a $40 billion stock buyback program. Microsoft raised its dividend to 39 cents per share from the prior 36 cents a share.\n\nFedEx — FedEx reported adjusted quarterly profit of $2.90 per share, nine cents a share above estimates. Revenue was slightly ahead of forecasts for the delivery services company. FedEx also raised its full-year guidance on better-than-expected performance in all its units, following the $4.8 billion purchase of Europe's TNT Express in May.\n\nAdobe Systems — Adobe came in three cents a share ahead of estimates, with adjusted quarterly profit of 75 cents per share. The software producer's revenue essentially in line. Adobe did give upbeat current-quarter guidance, as its Creative Cloud software package adds more subscribers.\n\nKB Home — KB Home earned 42 cents per share for its latest quarter, three cents a share above estimates. The home builder's revenue was shy of forecasts. KB Home did see a 16 percent increase in net orders, and an 11 percent rise in deliveries compared to a year earlier.\n\nNu Skin Enterprises — Nu Skin reached a nearly $766,000 settlement with the Securities and Exchange Commission over the health care products company's operations in China and the nature of a 2013 charitable contribution. Nu Skin did not admit or deny guilt as part of the settlement.\n\nCooper Companies — Cooper will replace Starwood Hotels in the S&P 500 after the close of trading Thursday, when Marriott's acquisition of Starwood is expected to be completed. The medical device maker will be replaced in the S&P MidCap 400 by electricity and natural gas provider Northwestern Corp.\n\nApple — Apple's iPhone 7 is more expensive to produce than its predecessors, according to a teardown performed by IHS Markit. The teardown indicates that the iPhone 7 costs nearly $225 to produce, about $37 more than the iPhone 6S.\n\nTesla — The automaker rolled out a security patch for its cars after China-based researchers said they uncovered vulnerabilities that allowed a remote attack on a Tesla Model S sedan.\n\nT-Mobile US — The wireless carrier could become a takeover target of NBCUniversal and CNBC parent Comcast, according to The Wall Street Journal's \"Heard On The Street\" column. The paper said such a move could be part of Comcast's plans to launch a wireless service by mid-2017.", "category": "tech", "title": "Early movers: GIS, DGX, WFC, RAI, SKX, MSFT, AAPL, KBH & more"}